000100880126       IDENTIFICATION DIVISION.
000200030708       PROGRAM-ID. ART100.
000300880126      /
000400030708      ***********************
000500030708      * This program check Article critical values
000600880126      ***********************
000700880126       ENVIRONMENT DIVISION.
000800880126      ***********************
000900880126      *
001000880126       CONFIGURATION SECTION.
001100880126      ***********************
001200880126      *
001300030708       SOURCE-COMPUTER. IBM-AS400.
001400030708       OBJECT-COMPUTER. IBM-AS400.
001500880126       COPY WSPECNAMES.
001600880126      *
001700880126       INPUT-OUTPUT SECTION.
001800880126       FILE-CONTROL.
001900030708           SELECT  ARTICLE
002000030708                   ASSIGN       TO DATABASE-ARTICLE1
002100961217                   ORGANIZATION IS INDEXED
002200961217                   ACCESS       IS DYNAMIC
002300961217                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
002400961217                   FILE STATUS  IS ST.
002500930512      *
002600030708           SELECT  ARTINFO
002700030708                   ASSIGN       TO DATABASE-ARTIINF
002800930903                   ORGANIZATION IS INDEXED
002900930908                   ACCESS       IS DYNAMIC
003000930903                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
003100030708                   WITH DUPLICATES
003200930903                   FILE STATUS  IS ST.
003300930903      *
003400030708           SELECT  ARTIPROV
003500030708                   ASSIGN       TO DATABASE-ARTIPROV
003600930903                   ORGANIZATION IS INDEXED
003700930908                   ACCESS       IS DYNAMIC
003800930903                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
003900930903                   FILE STATUS  IS ST.
004000930903      *
004100030708           SELECT  DETORD
004200030708                   ASSIGN       TO DATABASE-DETORD
004300030708                   ACCESS       IS SEQUENTIAL
004400930903                   FILE STATUS  IS ST.
004500930903      *
004600930909      /
004700000000       DATA    DIVISION.
004800000000       FILE    SECTION.
004900890921      *
005000030708       FD  ARTICLE   LABEL RECORD STANDARD.
005100030708       01  ART-ENR-DDS.
005200030708           COPY DDS-ALL-FORMAT OF ARTICLE1.
005300930903      *
005400030708       FD  ARTINFO   LABEL RECORD STANDARD.
005500030708       01  INFO-ENR-DDS.
005600030708           COPY DDS-ALL-FORMAT OF ARTIINF.
005700930903      *
005800030708       FD  ARTIPROV   LABEL RECORD STANDARD.
005900030708       01  PROV-ENR-DDS.
006000030708           COPY DDS-ALL-FORMAT OF ARTIPROV.
006100930903      *
006200030708       FD  DETORD  LABEL RECORD STANDARD.
006300030708       01  DET-ENR-DDS.
006400030708           COPY DDS-ALL-FORMAT OF DETORD.
006500941012      *
006600890607      /
006700000000       WORKING-STORAGE SECTION.
006800890921       77  CPT-LUS           PIC 9(6) VALUE ZERO.
006900890922       77  CPT-ECR           PIC 9(6) VALUE ZERO.
007000941012       77  CPT-ANO           PIC 9(6) VALUE ZERO.
007100931116       77  DR-QT                  PIC S9(8)V9(3) COMP-3.
007200941012       77  DR-PR                  PIC S9(6)V9(3) COMP-3.
007300941012       77  TOP-ENTERR        PIC 1    VALUE B"0".
007400941012      *
007500030708       77  ST                     PIC XX.
007600030708       77  WS-END                 PIC XX.
007700030708       77  WS-ERR                 PIC XX.
007800030708       77  WS-LIBERR              PIC X(35).
007900891121      *
008000910221       01  DATE-JOUR   VALUE SPACES.
008100910221           05  AN          PIC XX.
008200910221           05  MOI         PIC XX.
008300910221           05  JOUR        PIC XX.
008400930903      *
008500930903       01  HEURE-JOUR  VALUE SPACES.
008600930903           05  HH          PIC XX.
008700930903           05  MN          PIC XX.
008800930903           05  SS          PIC XX.
008900930903           05  CC          PIC XX.
009000941012      *
009100890523      /
009200990705      *
009300890607      ********************
009400910221       PROCEDURE DIVISION.
009500890607      ********************
009600030708       INIT SECTION.
009700030708      ********************
009800890607       DEBUT-PROG.
009900890607      ***** MESSAGE DE DEBUT
010000910221           ACCEPT   DATE-JOUR  FROM  DATE.
010100930903           ACCEPT   HEURE-JOUR FROM  TIME.
010200930909      *
010300030708           OPEN INPUT  DETORD.
010400941012      *
010500030708           OPEN INPUT  ARTICLE
010600030708                       ARTINFO
010700030708                       ARTIPROV.
010800941012      *
010900030708           MOVE "00" TO WS-END.
011000030708      *
011100030708           READ DETORD  NEXT AT END
011200030708                        MOVE HIGH-VALUE TO WS-END
011300030708                        GO  TO   VIDE.
011400030708      *
011500030708           PERFORM TRAITEMENT-DETAIL.
011600930906      *
011700930920       VIDE.
011800930916      *
011900030708           CLOSE  ARTICLE
012000030708                  ARTINFO
012100030708                  ARTIPROV
012200030708                  DETORD.
012300930906      *
012400930512           STOP    RUN.
012500030708      ***********************************************************
012600030708      ***  END PROGRAM
012700030708      ***********************************************************
012800030708      /
012900030708       TRAITEMENT-DETAIL SECTION.
013000030708      ***************************
013100930920      /
013200030708       TRT-RECORD.
013300030708           IF WS-END = "00" THEN
013400930920      *
013500030708           PERFORM WORKS-LINES.
013600930920      *
013700030708       READ-NEXT.
013800030708           READ DETORD  NEXT AT END
013900030708                        MOVE HIGH-VALUE TO WS-END
014000030708                        GO  TO   END-RECORD.
014100030708      *
014200030708       END-RECORD.
014300941012           EXIT.
014400941012      /
014500941012      ****************************************************************
014600941012      ******* SOUS-ROUTINE INITIALISATION DE BPFER
014700030708      ****************************************************************
014800030708      /
014900030708       WORKS-LINES SECTION.
015000030708      ***************************
015100030708      /
015200030708       TRT-RECORD.
015300030708      *
015400030708           MOVE ORDDAR TO  ARTIID OF ART-ENR-DDS
015500030708           READ ARTICLE INVALID KEY MOVE "88"  TO  WS-ERR
015600030708                                  MOVE "ARTICLE NOT FOUND" TO WS-LIBERR
015700030708                                  GO  TO     END-RECORD.
015800030708      *
015900030708           MOVE ORDDAR TO  ARTIID OF INFO-ENR-DDS
016000030708           READ ARTINFO INVALID KEY MOVE "99"  TO  WS-ERR
016100030708                                  MOVE "INFOS NOT FOUND" TO WS-LIBERR
016200030708                                  GO  TO     END-RECORD.
016300030708      *
016400030708           MOVE ORDDAR TO  ARTIID OF PROV-ENR-DDS
016500030708           READ ARTIPROV NEXT AT END MOVE "77"  TO  WS-ERR
016600030708                             MOVE "PROVIDER NOT FOUND" TO WS-LIBERR
016700030708                                   GO  TO     END-RECORD.
016800030708           IF ARTIID OF PROV-ENR-DDS NOT = ORDDAR
016900030708           THEN MOVE "77" TO WS-ERR.
017000030708      *
017100030708       END-RECORD.
017200030708           EXIT.
017300030708      /
017400941012
