000100880126       IDENTIFICATION DIVISION.
000200941010       PROGRAM-ID. BCBAL150.
000300880126      /
000400880126      ***********************
000500880126       ENVIRONMENT DIVISION.
000600880126      ***********************
000700880126      *
000800880126       CONFIGURATION SECTION.
000900880126      ***********************
001000880126      *
001100880126       SOURCE-COMPUTER. IBM-S38.
001200880126       OBJECT-COMPUTER. IBM-S38.
001300880126       COPY WSPECNAMES.
001400880126      *
001500880126       INPUT-OUTPUT SECTION.
001600880126       FILE-CONTROL.
001700961217           SELECT  BPFALZA
001800961217                   ASSIGN       TO DATABASE-BLFALZA1
001900961217                   ORGANIZATION IS INDEXED
002000961217                   ACCESS       IS DYNAMIC
002100961217                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
002200961217                   WITH DUPLICATES
002300961217                   FILE STATUS  IS ST.
002400930512      *
002500930903           SELECT  APFCC
002600930903                   ASSIGN       TO DATABASE-APFCC
002700930903                   ORGANIZATION IS INDEXED
002800930908                   ACCESS       IS DYNAMIC
002900930903                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
003000930903                   FILE STATUS  IS ST.
003100930903      *
003200930903           SELECT  ZPFFR
003300930903                   ASSIGN       TO DATABASE-ZPFFR
003400930903                   ORGANIZATION IS INDEXED
003500930908                   ACCESS       IS DYNAMIC
003600930903                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
003700930903                   FILE STATUS  IS ST.
003800930903      *
003900930903           SELECT  BPFAR100
004000930903                   ASSIGN       TO DATABASE-BPFAR100
004100930903                   ORGANIZATION IS INDEXED
004200930908                   ACCESS       IS DYNAMIC
004300930903                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
004400930903                   FILE STATUS  IS ST.
004500930903      *
004600941011           SELECT  BPFERM61
004700941011                   ASSIGN       TO DATABASE-BPFERM61
004800941011                   ORGANIZATION IS INDEXED
004900941011                   ACCESS       IS DYNAMIC
005000941011                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
005100941011                   FILE STATUS  IS ST.
005200941011      *
005300941011           SELECT  BPFER
005400941011                   ASSIGN       TO DATABASE-BPFER
005500941011                   ORGANIZATION IS INDEXED
005600941011                   ACCESS       IS DYNAMIC
005700941011                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
005800941011                   FILE STATUS  IS ST.
005900941011      *
006000941011           SELECT  BPFDR
006100941011                   ASSIGN       TO DATABASE-BPFDR
006200941011                   ORGANIZATION IS INDEXED
006300941011                   ACCESS       IS DYNAMIC
006400941011                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
006500941011                             WITH DUPLICATES
006600941011                   FILE STATUS  IS ST.
006700941011      *
006800941012           SELECT  BPFSK
006900941012                   ASSIGN       TO DATABASE-BPFSK
007000941012                   ORGANIZATION IS INDEXED
007100941012                   ACCESS       IS DYNAMIC
007200941012                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
007300941012                                   WITH DUPLICATES
007400941012                   FILE STATUS  IS ST.
007500941012      *
007600941012           SELECT  FINFODI
007700941012                   ASSIGN       TO DATABASE-ALFIN1
007800941012                   ORGANIZATION IS INDEXED
007900941012                   ACCESS       IS DYNAMIC
008000941012                   RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
008100941012                   FILE STATUS  IS ST.
008200941012      *
008300930903           SELECT  BPFALANO
008400941011                   ASSIGN       TO DATABASE-BPFALAAO
008500930903                   ORGANIZATION IS SEQUENTIAL
008600930903                   ACCESS       IS SEQUENTIAL
008700930903                   FILE STATUS  IS ST.
008800940118      *
008900930909      /
009000000000       DATA    DIVISION.
009100000000       FILE    SECTION.
009200890921      *
009300961217       FD  BPFALZA   LABEL RECORD STANDARD.
009400961217       01  AZ-ENR-DDS.
009500961217           COPY DDS-ALL-FORMAT OF BLFALZA1.
009600930903      *
009700930903       FD  APFCC     LABEL RECORD STANDARD.
009800930903       01  CC-ENR-DDS.
009900930903           COPY DDS-ALL-FORMAT OF APFCC.
010000930903      *
010100930903       FD  ZPFFR     LABEL RECORD STANDARD.
010200930903       01  FR-ENR-DDS.
010300930903           COPY DDS-ALL-FORMAT OF ZPFFR.
010400930903      *
010500930903       FD  BPFAR100  LABEL RECORD STANDARD.
010600930903       01  AR-ENR-DDS.
010700930903           COPY DDS-ALL-FORMAT OF BPFAR100.
010800930903      *
010900941011       FD  BPFERM61  LABEL RECORD STANDARD.
011000941011       01  ER61-ENR-DDS.
011100941011           COPY DDS-ALL-FORMAT OF BPFERM61.
011200941011      *
011300941011       FD  BPFER     LABEL RECORD STANDARD.
011400941011       01  ER-ENR-DDS.
011500941011           COPY DDS-ALL-FORMAT OF BPFER.
011600941011      *
011700941011       FD  BPFDR     LABEL RECORD STANDARD.
011800941011       01  DR-ENR-DDS.
011900941011           COPY DDS-ALL-FORMAT OF BPFDR.
012000931117      *
012100941012       FD  BPFSK  LABEL RECORD STANDARD.
012200941012       01   SK-ENR-DDS.
012300941012           COPY DDS-ALL-FORMAT OF BPFSK.
012400941012      *
012500941012           COPY FDAPFIN.
012600941012           COPY    FDINTVA.
012700941012           COPY    FDINTYPREC.
012800941012       01  INPG-ENR-DDS.
012900941012           05  FILLER          PIC X(61).
013000941012           05  INPG-DEST       PIC X(50).
013100941012           05  FILLER          PIC X(145).
013200941012       01  IN-ENR-DDS.
013300941012           COPY    DDS-ALL-FORMATS  OF  ALFIN1.
013400941012      *
013500930903       FD  BPFALANO  LABEL RECORD STANDARD.
013600930903       01  ALA-ENR-DDS.
013700941011           COPY DDS-ALL-FORMAT OF BPFALAAO.
013800890607      /
013900000000       WORKING-STORAGE SECTION.
014000890921       77  CPT-LUS           PIC 9(6) VALUE ZERO.
014100890922       77  CPT-ECR           PIC 9(6) VALUE ZERO.
014200941012       77  CPT-ANO           PIC 9(6) VALUE ZERO.
014300931116       77  DR-QT                  PIC S9(8)V9(3) COMP-3.
014400941012       77  DR-PR                  PIC S9(6)V9(3) COMP-3.
014500941012       77  TOP-ENTERR        PIC 1    VALUE B"0".
014600941012      *
014700941012       77  NEG-STK                PIC S9(8)V9(3) COMP-3.
014800941012       77  OLD-ARSTK              PIC S9(8)V9(3) COMP-3.
014900941012       77  OLD-STK                PIC S9(8)V9(3) COMP-3.
015000941012       77  NEW-STK                PIC S9(8)V9(3) COMP-3.
015100941012       77  CAL-PRX                PIC S9(10)V9(5) COMP-3.
015200941012       77  WSTAT-AN               PIC XX.
015300941012       77  WSTAT-MOIS             PIC XX.
015400941012      *
015500930907       01  WCIDD             PIC X(5) VALUE SPACES.
015600930906       01  WCIDL             PIC X(5) VALUE SPACES.
015700930907       01  WERCMD            PIC X(8) VALUE SPACES.
015800930908       01  WCNUF             PIC X(6) VALUE SPACES.
015900941012       01  WKNORD.
016000941012           05  WKNORD9       PIC 9(5) VALUE ZERO.
016100930907      *
016200941012       01  IDENT-ER VALUE SPACES.
016300941012           05  WERCNUF       PIC X(6).
016400941012           05  WERAAL        PIC XX.
016500941012           05  WERMML        PIC XX.
016600941012           05  WERJJL        PIC XX.
016700961217           05  WERCAPP       PIC XXX.
016800941012           05  WERNORD       PIC X(5).
016900941012      *
017000941012       01  IDENT-DR VALUE SPACES.
017100930909           05  WRAC-DR         PIC X(6).
017200930909           05  WCCC-DR         PIC X.
017300930909           05  WVPV-DR         PIC XX.
017400930513      *
017500941012       01  WARART VALUE SPACES.
017600941012           05  WARRAC          PIC X(6).
017700941012           05  WARCCC          PIC X.
017800941012           05  WARVPV          PIC XX.
017900941012      *
018000941215       01  RESART VALUE SPACES.
018100941215           05  RESRAC          PIC X(6).
018200941215           05  RESCCC          PIC X.
018300941215           05  RESVPV          PIC XX.
018400941215      *
018500931117       01  WECRAN.
018600931117           05  FILLER          PIC X(9).
018700931117           05  TOP-MAJ         PIC X.
018800941012      *
018900941012       01  WTVA-FIC.
019000941012           05  WTVA-FIC9                 PIC 9(2).
019100941012      *
019200941012       01  WCALCULS.
019300941012           05  WQTE              PIC S9(6)V9(3)   COMP-3.
019400941012           05  WMPA              PIC S9(8)V9(3)   COMP-3.
019500941012           05  WMPAB             PIC S9(8)V9(3)   COMP-3.
019600941012           05  WMPR              PIC S9(8)V9(3)   COMP-3.
019700941012           05  WMTVA             PIC S9(8)V9(3)   COMP-3.
019800941012           05  WMVIG             PIC S9(9)V9(2)   COMP-3.
019900941012           05  WMPA-RF           PIC S9(8)V9(3)   COMP-3.
020000941012           05  WMRF              PIC S9(8)V9(3)   COMP-3.
020100941012           05  WMRIS             PIC S9(8)V9(3)   COMP-3.
020200941012           05  WMCOO             PIC S9(8)V9(3)   COMP-3.
020300941012           05  WMNEG             PIC S9(8)V9(3)   COMP-3.
020400941012           05  WMRGD             PIC S9(8)V9(3)   COMP-3.
020500941012           05  WMTRS             PIC S9(8)V9(3)   COMP-3.
020600941012           05  WMTVT             PIC S9(8)V9(3)   COMP-3.
020700930909      *
020800941012           COPY    WKTABTVA.
020900941011           COPY    WKREFPGM         REPLACING SPACE BY "BCBAL150*A".
021000890522           COPY    WKGENERAL.
021100890607           COPY    WKMESSAGE.
021200930512           COPY    WKLDA.
021300891121      *
021400910221       01  DATE-JOUR   VALUE SPACES.
021500910221           05  AN          PIC XX.
021600910221           05  MOI         PIC XX.
021700910221           05  JOUR        PIC XX.
021800930903      *
021900930903       01  HEURE-JOUR  VALUE SPACES.
022000930903           05  HH          PIC XX.
022100930903           05  MN          PIC XX.
022200930903           05  SS          PIC XX.
022300930903           05  CC          PIC XX.
022400930907      *
022500941012           COPY  WKDAT000.
022600941012      *
022700941012       01  WKAA.
022800961217           COPY  DDS-ALL-FORMAT OF BPFALZA.
022900941012       01  WKAR.
023000941012           COPY  DDS-ALL-FORMAT OF BPFAR100.
023100941012       01  SAVE-SK-ENR-DDS.
023200941012           COPY  DDS-ALL-FORMAT OF BPFSK.
023300941012       01  WKCCD.
023400941012           COPY  DDS-ALL-FORMAT OF APFCC.
023500941012      *
023600890523      /
023700990705      *
023800990705      *DEBUT AF0*
023900990705           COPY WKAFER.
024000990706           COPY WKAFSK.
024100990705      *FIN   AF0*
024200990705      *
024300890607      ********************
024400910221       PROCEDURE DIVISION.
024500890607      ********************
024600890607       DEBUT-PROG.
024700890607      ***** MESSAGE DE DEBUT
024800890607           MOVE    SPACE       TO  WK-MESSAGE-LIB.
024900910221           STRING " DEBUT ---> " REF-PGM
025000890607                   DELIMITED  BY SIZE
025100890607                   INTO  WK-MESSAGE-LIB.
025200890607           PERFORM AFF-MESSAGE  THRU  AFF-MESSAGE-EXIT.
025300910221           ACCEPT   DATE-JOUR  FROM  DATE.
025400930903           ACCEPT   HEURE-JOUR FROM  TIME.
025500930914      *
025600941012           MOVE     SPACE  TO  WAAMMJJ.
025700941012           CALL     "ACBDT000" USING WKDAT000.
025800941012      *
025900930903           ACCEPT   WKLDA  FROM  LDA.
026000930909      *
026100941012           OPEN INPUT  FINFODI.
026200941012           COPY SRLTVA.
026300941012           CLOSE FINFODI WITH LOCK.
026400941012      *
026500941012      ***** RECUPERATION AN MOIS STAT.
026600941012           CALL  "BCLRC530" USING WSTAT-AN WSTAT-MOIS.
026700941012      *
026800961217           OPEN INPUT  BPFALZA
026900930906                       APFCC
027000930906                       ZPFFR
027100941011                       BPFERM61
027200941011                I-O    BPFDR
027300941011                       BPFER
027400941012                       BPFAR100
027500941012                       BPFSK
027600930906                OUTPUT BPFALANO.
027700941012      *
027800930920           PERFORM  LECT  THRU  F-CONT-LECT.
027900961217           IF   BLRALZA1 OF AZ-ENR-DDS = HIGH-VALUE GO  TO  VIDE.
028000930916      *
028100930920       INIT-RUPT-ENTETE.
028200941012           PERFORM  CONT-ENT-REC THRU CONT-ENT-REC-EXIT.
028300941012           IF   TOP-ENTERR = VRAI      GO  TO  LECT1.
028400941012      *
028500961217           MOVE AZCNFE OF AZ-ENR-DDS  TO  WERCNUF.
028600961217           MOVE AZAALV OF AZ-ENR-DDS  TO  WERAAL.
028700961217           MOVE AZMMLV OF AZ-ENR-DDS  TO  WERMML.
028800961217           MOVE AZJJLV OF AZ-ENR-DDS  TO  WERJJL.
028900961217           MOVE AZCAPP OF AZ-ENR-DDS  TO  WERCAPP.
029000961217           MOVE AZNORD OF AZ-ENR-DDS  TO  WERNORD.
029100930920      *
029200930920       INIT-RUPT-ARTICLE.
029300930920           MOVE ZERO    TO  DR-QT.
029400961218      *    MOVE AR-ENR-DDS    TO     WKAR.
029500941011           MOVE WARRAC        TO  WRAC-DR.
029600941011           MOVE WARCCC        TO  WCCC-DR.
029700941011           MOVE WARVPV        TO  WVPV-DR.
029800961217           MOVE BLRALZA1 OF AZ-ENR-DDS  TO  WKAA.
029900930920      *
030000930920       TRAIT-DETAIL.
030100961217           ADD  AZQT  OF AZ-ENR-DDS  TO  DR-QT.
030200961217           MOVE AZPA  OF AZ-ENR-DDS  TO  DR-PR.
030300930920      *
030400930920       LECT1.
030500930920           PERFORM      LECT  THRU  F-CONT-LECT.
030600930920      *
030700961217           IF   AZCNFE OF AZ-ENR-DDS  =   WERCNUF AND
030800961217                AZAALV OF AZ-ENR-DDS  =   WERAAL  AND
030900961217                AZMMLV OF AZ-ENR-DDS  =   WERMML  AND
031000961217                AZJJLV OF AZ-ENR-DDS  =   WERJJL  AND
031100961217                AZCAPP OF AZ-ENR-DDS  =   WERCAPP AND
031200961217                AZNORD OF AZ-ENR-DDS  =   WERNORD AND
031300961217                WARRAC                =   WRAC-DR AND
031400961217                WARCCC                =   WCCC-DR AND
031500961217                WARVPV                =   WVPV-DR
031600930920                GO  TO  TRAIT-DETAIL.
031700930906      *
031800941012           IF  DR-QT NOT = ZERO
031900941012               PERFORM  VALID-RECEP  THRU  VALID-RECEP-EXIT.
032000930920      *
032100961217           IF   AZCNFE OF AZ-ENR-DDS  =   WERCNUF AND
032200961217                AZAALV OF AZ-ENR-DDS  =   WERAAL  AND
032300961217                AZMMLV OF AZ-ENR-DDS  =   WERMML  AND
032400961217                AZJJLV OF AZ-ENR-DDS  =   WERJJL  AND
032500961217                AZCAPP OF AZ-ENR-DDS  =   WERCAPP AND
032600961217                AZNORD OF AZ-ENR-DDS  =   WERNORD
032700930921                          GO  TO  INIT-RUPT-ARTICLE.
032800941012      *
032900941012           IF  ERNLIG OF ER-ENR-DDS  NOT = ZERO
033000941012               PERFORM  MAJ-ENT-REC  THRU  MAJ-ENT-REC-EXIT.
033100930920      *
033200961217           IF  BLRALZA1 OF AZ-ENR-DDS NOT = HIGH-VALUE
033300930920                          GO  TO  INIT-RUPT-ENTETE.
033400930906      *
033500930920       VIDE.
033600930916      *
033700961217           CLOSE  BPFALZA ZPFFR  APFCC
033800961217                  BPFAR100 BPFSK BPFDR BPFERM61 BPFER
033900941012                  BPFALANO.
034000930906      *
034100930906           MOVE SPACE TO WK-MESSAGE-LIB.
034200930906           STRING  "   LUS : " CPT-LUS
034300930906                   "   ECR : " CPT-ECR
034400941012                   "   ANO : " CPT-ANO
034500930906                   DELIMITED BY SIZE  INTO WK-MESSAGE-LIB.
034600930906           PERFORM AFF-MESSAGE        THRU    AFF-MESSAGE-EXIT.
034700930906      *
034800930906           MOVE    SPACE       TO  WK-MESSAGE-LIB.
034900930906           STRING "  FIN  ---> " REF-PGM
035000930906                   DELIMITED  BY SIZE
035100930906                   INTO  WK-MESSAGE-LIB.
035200930906           PERFORM AFF-MESSAGE  THRU  AFF-MESSAGE-EXIT.
035300930512           STOP    RUN.
035400930512      *
035500930512       COPY SRMSGBATCH.
035600930920      /
035700930920       LECT.
035800961217           READ BPFALZA NEXT AT END
035900961217                        MOVE HIGH-VALUE TO BLRALZA1 OF AZ-ENR-DDS
036000961217                        GO  TO   F-CONT-LECT.
036100930920      *
036200930920           ADD  1       TO  CPT-LUS.
036300931110      ******* TEST SI VA = "0 " VA = "  " ****************
036400961217           IF   AZVA OF AZ-ENR-DDS = "0 " OR AZVA OF AZ-ENR-DDS = "00"
036500961217                MOVE "  "  TO AZVA OF AZ-ENR-DDS.
036600951123      *
036700961217           IF   AZNORD OF AZ-ENR-DDS  = SPACES
036800961217                MOVE   "00001"        TO  AZNORD OF AZ-ENR-DDS.
036900930920      *
037000930920      **** INITIALISATION ANOMALIE
037100930920      *
037200961217           MOVE BLRALZA1 OF AZ-ENR-DDS TO  BPRAAO.
037300930920      *
037400930920      **** CONTROLE FOURNISSEUR
037500930920      *
037600961217           IF   AZCNFE OF AZ-ENR-DDS = WCNUF GO  TO  CONT-CLI.
037700961217           MOVE AZCNFE OF AZ-ENR-DDS TO  FRCNUF.
037800930920           READ ZPFFR INVALID KEY MOVE "01"  TO  AAANO
037900930920                                  MOVE "FOURNISSEUR INCONNU" TO AALANO
038000930920                                  PERFORM    ECR-ANO THRU ECR-ANO-EXIT
038100930920                                  GO  TO     LECT.
038200930920      *
038300961217           MOVE AZCNFE OF AZ-ENR-DDS TO  WCNUF.
038400930920      *
038500930920      **** CONTROLE CLIENT
038600930920      *
038700931116       CONT-CLI.
038800930920      *
038900961217           IF   AZCIDL OF AZ-ENR-DDS = WCIDL   GO  TO   CONT-ART.
039000951123      *
039100961217           MOVE AZCIDL OF AZ-ENR-DDS  TO  CCID OF CC-ENR-DDS.
039200951123           READ APFCC INVALID KEY
039300951123                     MOVE    SPACE       TO  WK-MESSAGE-LIB
039400951123                     STRING " CLIENT INCONNU " REF-PGM
039500951123                             DELIMITED  BY SIZE
039600951123                             INTO  WK-MESSAGE-LIB
039700951123                     PERFORM AFF-MESSAGE  THRU  AFF-MESSAGE-EXIT
039800951123                     GO  TO  TILT.
039900951123      *
040000951123           IF   CCATM  OF CC-ENR-DDS = "08"
040100951123                          MOVE   CCID OF CC-ENR-DDS  TO  WCIDL
040200951123                          MOVE   CC-ENR-DDS          TO  WKCCD
040300951123                          GO  TO  CONT-ART.
040400951123      *
040500951123           MOVE "03"  TO  AAANO.
040600951123           MOVE "CAT. CLIENT.NON PREVU " TO AALANO
040700951123           PERFORM    ECR-ANO THRU ECR-ANO-EXIT
040800951123           GO  TO     LECT.
040900930920      *
041000930920      **** CONTROLE ARTICLE
041100930920      *
041200930920       CONT-ART.
041300930920      *
041400961218           MOVE AZRAC OF AZ-ENR-DDS TO  ARRAC OF AR-ENR-DDS.
041500961218           MOVE AZCCC OF AZ-ENR-DDS TO  ARCCC OF AR-ENR-DDS.
041600961218           MOVE AZVPV OF AZ-ENR-DDS TO  ARVPV OF AR-ENR-DDS.
041700961218      *
041800961218           READ BPFAR100  INVALID KEY  MOVE "06"  TO  AAANO
041900961218                          MOVE "ARTICLE INCONNU" TO AALANO
042000961218                          PERFORM    ECR-ANO THRU ECR-ANO-EXIT
042100961218                          GO  TO     VALID-RECEP-EXIT.
042200961218      *
042300961217           MOVE AZRAC OF AZ-ENR-DDS TO  WARRAC.
042400961217           MOVE AZCCC OF AZ-ENR-DDS TO  WARCCC.
042500961217           MOVE AZVPV OF AZ-ENR-DDS TO  WARVPV.
042600930920       F-CONT-LECT.
042700930920           EXIT.
042800930906      /
042900930906       ECR-ANO.
043000930908           WRITE ALA-ENR-DDS.
043100941012           ADD  1       TO  CPT-ANO.
043200930906       ECR-ANO-EXIT.
043300930906           EXIT.
043400930906      /
043500941012       CONT-ENT-REC.
043600941012      *****  LECTURE ENTETE RECEPTION
043700941012           MOVE FAUX TO TOP-ENTERR.
043800951123      *
043900961217           MOVE AZNORD OF AZ-ENR-DDS  TO  WKNORD.
044000941012           PERFORM INIT-ER-CLE THRU INIT-ER-CLE-EXIT.
044100941012           READ BPFER INVALID GO CONTR-ENT-ER-INEX.
044200941012      *
044300941012           MOVE VRAI  TO  TOP-ENTERR.
044400960105           MOVE ZERO  TO  ERNLIG OF ER-ENR-DDS
044500960105                          DR-QT.
044600941012           MOVE "09"                     TO AAANO.
044700941012           MOVE "RECEPT. DEJA EXISTANTE" TO AALANO.
044800941012           PERFORM ECR-ANO THRU ECR-ANO-EXIT.
044900941012           GO   TO    CONT-ENT-REC-EXIT.
045000941012      *
045100941012       CONTR-ENT-ER-INEX.
045200941012           PERFORM INIT-ER-CLE THRU INIT-ER-CLE-EXIT.
045300941012           MOVE ER-ENR-DDS TO ER61-ENR-DDS.
045400941012           READ BPFERM61 NOT INVALID
045500941012               MOVE VRAI TO TOP-ENTERR
045600941012               MOVE ZERO TO ERNLIG OF ER-ENR-DDS
045700960105                            DR-QT
045800941012               MOVE "09"                     TO AAANO
045900941012               MOVE "RECEPT. MENSUELLE EXISTANTE" TO AALANO
046000941012               PERFORM ECR-ANO THRU ECR-ANO-EXIT
046100941012               GO CONT-ENT-REC-EXIT.
046200941012           PERFORM INIT-ER THRU INIT-ER-EXIT.
046300941012       CONT-ENT-REC-EXIT.
046400941012           EXIT.
046500941012      /
046600941012      ****************************************************************
046700941012      ******* SOUS-ROUTINE INITIALISATION DE BPFER
046800941012      ****************************************************************
046900941012       INIT-ER.
047000941012           PERFORM INIT-ER-CLE THRU INIT-ER-CLE-EXIT.
047100941012           MOVE SPACES    TO ERNCMD  OF ER-ENR-DDS.
047200941012           MOVE ARCIF OF AR-ENR-DDS    TO ERCIFC  OF ER-ENR-DDS
047300941012                                          ERCIFR  OF ER-ENR-DDS.
047400941012           MOVE FRNSF   OF ZPRFR   TO ERNSL   OF ER-ENR-DDS.
047500941012           MOVE 1                  TO ERNTRT  OF ER-ENR-DDS.
047600941012           MOVE ZERO               TO ERTME   OF ER-ENR-DDS
047700941012                                      ERTMG   OF ER-ENR-DDS.
047800941012           MOVE "01"               TO ERNTRC  OF ER-ENR-DDS.
047900941012           MOVE CCNUD OF WKCCD     TO ERCNUD  OF ER-ENR-DDS.
048000941012           MOVE CSOCG OF WKCCD     TO ERSTE   OF ER-ENR-DDS.
048100941012           MOVE CCATM OF WKCCD     TO ERCATR  OF ER-ENR-DDS
048200941012                                      ERCATM  OF ER-ENR-DDS.
048300941012           MOVE FRRIST  OF ZPRFR   TO ERTRIS  OF ER-ENR-DDS.
048400941012           MOVE FRCOOP  OF ZPRFR   TO ERTCOO  OF ER-ENR-DDS.
048500941012           MOVE ZERO               TO ERTREM  OF ER-ENR-DDS.
048600941012           MOVE FRFONC  OF ZPRFR   TO ERTRF   OF ER-ENR-DDS.
048700941012           MOVE ARDEP OF AR-ENR-DDS TO ERDEP   OF ER-ENR-DDS.
048800941012           MOVE ARRAY OF AR-ENR-DDS TO ERRAY   OF ER-ENR-DDS.
048900941012           MOVE AN                 TO ERAAC   OF ER-ENR-DDS.
049000941012           MOVE MOI                TO ERMMC   OF ER-ENR-DDS.
049100941012           MOVE JOUR               TO ERJJC   OF ER-ENR-DDS.
049200941012           MOVE AN                 TO ERAAM   OF ER-ENR-DDS.
049300941012           MOVE MOI                TO ERMMM   OF ER-ENR-DDS.
049400941012           MOVE JOUR               TO ERJJM   OF ER-ENR-DDS.
049500941012           MOVE WNO-SEMAINE        TO ERTOP1  OF ER-ENR-DDS.
049600941012           MOVE ARNENT OF AR-ENR-DDS TO ERTOP3  OF ER-ENR-DDS.
049700941012           MOVE ZERO               TO ERFPA   OF ER-ENR-DDS
049800941012                                      ERFPV   OF ER-ENR-DDS
049900941012                                      ERFTVA  OF ER-ENR-DDS
050000941012                                      ERFVIG  OF ER-ENR-DDS
050100941012                                      ERFTRS  OF ER-ENR-DDS
050200941012                                      ERFTVT  OF ER-ENR-DDS
050300941012                                      ERFPAR  OF ER-ENR-DDS
050400941012                                      ERFTX1  OF ER-ENR-DDS
050500941012                                      ERFTX2  OF ER-ENR-DDS
050600941012           MOVE ZERO               TO ERARPA  OF ER-ENR-DDS
050700941012                                      ERARTV  OF ER-ENR-DDS.
050800941012           MOVE "00"               TO ERDIFF  OF ER-ENR-DDS.
050900941012           MOVE ZERO               TO ERMPA   OF ER-ENR-DDS
051000941012                                      ERMPV   OF ER-ENR-DDS
051100941012                                      ERMTVA  OF ER-ENR-DDS
051200941012                                      ERMVIG  OF ER-ENR-DDS
051300941012                                      ERNLIG  OF ER-ENR-DDS
051400941012                                      ERMTVV  OF ER-ENR-DDS
051500941012                                      ERMAVD  OF ER-ENR-DDS
051600941012                                      ERMRIS  OF ER-ENR-DDS
051700941012                                      ERMCOO  OF ER-ENR-DDS
051800941012                                      ERMNEG  OF ER-ENR-DDS
051900941012                                      ERMRGD  OF ER-ENR-DDS
052000941012                                      ERMEMB  OF ER-ENR-DDS
052100941012                                      ERMRF   OF ER-ENR-DDS
052200941012                                      ERMTRS  OF ER-ENR-DDS
052300941012                                      ERMTRS  OF ER-ENR-DDS
052400941012                                      ERMTVT  OF ER-ENR-DDS
052500941012                                      ERMTX1  OF ER-ENR-DDS
052600941012                                      ERMTX2  OF ER-ENR-DDS.
052700941012       INIT-ER-EXIT.
052800941012           EXIT.
052900941012
053000941012      ****************************************************************
053100941012      ******* SOUS-ROUTINE MAJ CLEF DE BPFER
053200941012      ****************************************************************
053300941012       INIT-ER-CLE.
053400941012           MOVE SPACE                 TO ER-ENR-DDS.
053500941012           MOVE "01"                  TO ERTYRC OF ER-ENR-DDS.
053600990705           MOVE CCID  OF WKCCD        TO ERCIDR OF ER-ENR-DDS.
053700961218           MOVE AZCAPP OF AZ-ENR-DDS  TO ERKAPP OF ER-ENR-DDS.
053800941012           MOVE SPACE                 TO ERKDEP OF ER-ENR-DDS.
053900941012           MOVE SPACE                 TO ERKRAY OF ER-ENR-DDS.
054000941012           MOVE SPACE                 TO ERKSEC OF ER-ENR-DDS.
054100961217           MOVE AZCNFE OF AZ-ENR-DDS  TO ERCNUL OF ER-ENR-DDS.
054200941012           MOVE "01"                  TO ERNENT OF ER-ENR-DDS.
054300941012           MOVE SPACE                 TO ERCID  OF ER-ENR-DDS.
054400990705      *DEBUT AF0*
054500990705      *    MOVE AZAALV OF AZ-ENR-DDS  TO ERAARC OF ER-ENR-DDS.
054600990705      *    MOVE AZMMLV OF AZ-ENR-DDS  TO ERMMRC OF ER-ENR-DDS.
054700990705      *    MOVE AZJJLV OF AZ-ENR-DDS  TO ERJJRC OF ER-ENR-DDS.
054800990705           IF AZAALV OF AZ-ENR-DDS  > "50"
054900990705              MOVE "19"               TO WK-ERXXRC-SS
055000990705           ELSE
055100990705              MOVE "20"               TO WK-ERXXRC-SS
055200990705           END-IF
055300990705           MOVE AZAALV OF AZ-ENR-DDS  TO WK-ERAARC-S.
055400990705           MOVE AZMMLV OF AZ-ENR-DDS  TO WK-ERMMRC-S.
055500990705           MOVE AZJJLV OF AZ-ENR-DDS  TO WK-ERJJRC-S.
055600990705           PERFORM SRAFER2O
055700990705      *FIN   AF0*
055800941012           MOVE WKNORD                TO ERNORD OF ER-ENR-DDS.
055900941012       INIT-ER-CLE-EXIT.
056000941012           EXIT.
056100941012      /
056200941012       VALID-RECEP.
056300941012           MOVE WRAC-DR  TO  ARRAC OF AR-ENR-DDS.
056400941012           MOVE WCCC-DR  TO  ARCCC OF AR-ENR-DDS.
056500941012           MOVE WVPV-DR  TO  ARVPV OF AR-ENR-DDS.
056600941012      *
056700941012           READ BPFAR100  INVALID KEY  MOVE "06"  TO  AAANO
056800941012                          MOVE "ARTICLE INCONNU" TO AALANO
056900941012                          PERFORM    ECR-ANO THRU ECR-ANO-EXIT
057000941012                          GO  TO     VALID-RECEP-EXIT.
057100941012      *
057200941012      ******* Sauvegarde des stocks et prx anciens
057300941012           MOVE ARSTK  OF AR-ENR-DDS TO OLD-STK.
057400941012      ******* Cumul sur compteur quantité reçue
057500941012           IF WERAAL   NOT = ARRCAA OF AR-ENR-DDS OR
057600941012              WERMML   NOT = ARRCMM OF AR-ENR-DDS OR
057700941012              WERJJL   NOT = ARRCJJ OF AR-ENR-DDS
057800941012              MOVE ZERO     TO ARRCQT OF AR-ENR-DDS
057900941012              MOVE WERAAL   TO ARRCAA OF AR-ENR-DDS
058000941012              MOVE WERMML   TO ARRCMM OF AR-ENR-DDS
058100941012              MOVE WERJJL   TO ARRCJJ OF AR-ENR-DDS.
058200941012           ADD DR-QT                 TO ARRCQT OF AR-ENR-DDS.
058300941012           MOVE ZERO  TO  NEG-STK.
058400941012      ******* Mise à jour des stocks et des PRX SI PAS FICTIF
058500941012           IF ARSTKE OF AR-ENR-DDS NOT = "F"
058600941012              MOVE ARSTK OF AR-ENR-DDS   TO OLD-ARSTK
058700941012              ADD DR-QT                  TO ARSTK OF AR-ENR-DDS
058800941012              IF ARSTK OF AR-ENR-DDS < 0
058900941012                   MOVE ARSTK OF AR-ENR-DDS TO NEG-STK
059000941012                   MOVE ZERO TO ARSTK OF AR-ENR-DDS
059100941012              END-IF
059200941012              IF (ARSTK OF AR-ENR-DDS + ARSTPP OF AR-ENR-DDS
059300941012                + ARSTKB OF AR-ENR-DDS) > 0
059400941012                COMPUTE CAL-PRX =
059500941012                   ( (ARPRX OF AR-ENR-DDS *
059600941012                      (OLD-ARSTK + ARSTPP OF AR-ENR-DDS
059700941012                                 + ARSTKB OF AR-ENR-DDS) )  +
059800941012                   ( DR-PR               * DR-QT                 ) ) /
059900941012                   ( ARSTK OF AR-ENR-DDS + ARSTPP OF AR-ENR-DDS
060000941012                                         + ARSTKB OF AR-ENR-DDS )
060100941012                COMPUTE ARPRX OF AR-ENR-DDS ROUNDED = CAL-PRX.
060200941012           IF ARPRX OF AR-ENR-DDS = ZERO AND
060300941012              (ARSTK  OF AR-ENR-DDS > ZERO OR
060400941012               ARSTPP OF AR-ENR-DDS > ZERO OR
060500941012               ARSTKB OF AR-ENR-DDS > ZERO)
060600941012                    MOVE ARPR OF AR-ENR-DDS TO ARPRX OF AR-ENR-DDS.
060700941012           IF ARPRX OF AR-ENR-DDS < ZERO
060800941012                    MOVE ARPR OF AR-ENR-DDS TO ARPRX OF AR-ENR-DDS.
060900941012
061000941012           MOVE ARSTK  OF AR-ENR-DDS TO NEW-STK.
061100941012
061200941012           IF ARSTK OF AR-ENR-DDS  = ZERO AND
061300941012              ARSTKE OF AR-ENR-DDS = SPACE
061400941012                     MOVE  "M" TO ARSTKE OF  AR-ENR-DDS.
061500941012           IF ARSTK OF AR-ENR-DDS  NOT = ZERO AND
061600941012              ARSTKE OF AR-ENR-DDS = "M"
061700941012                     MOVE  SPACE TO ARSTKE OF  AR-ENR-DDS.
061800941012
061900941012      ******* Constitution Fichier mouvement de stock
062000941012           MOVE ARRAC  OF AR-ENR-DDS  TO SKRAC  OF SK-ENR-DDS.
062100941012           MOVE ARCCC  OF AR-ENR-DDS  TO SKCCC  OF SK-ENR-DDS.
062200941012           MOVE ARVPV  OF AR-ENR-DDS  TO SKVPV  OF SK-ENR-DDS.
062300941012           MOVE ARMOD  OF AR-ENR-DDS  TO SKMOD  OF SK-ENR-DDS.
062400990706      *DEBUT AF0*
062500990706      *    MOVE AZAACR OF WKAA        TO SKAAM  OF SK-ENR-DDS.
062600990706      *    MOVE AZMMCR OF WKAA        TO SKMMM  OF SK-ENR-DDS.
062700990706      *    MOVE AZJJCR OF WKAA        TO SKJJM  OF SK-ENR-DDS.
062800990706           IF AZAACR OF WKAA > "50"
062900990706              MOVE "19"               TO WK-SKXXM-SS
063000990706           ELSE
063100990706              MOVE "20"               TO WK-SKXXM-SS
063200990706           END-IF
063300990706           MOVE AZAACR OF WKAA        TO WK-SKAAM-S.
063400990706           MOVE AZMMCR OF WKAA        TO WK-SKMMM-S.
063500990706           MOVE AZJJCR OF WKAA        TO WK-SKJJM-S.
063600990706      *FIN   AF0*
063700961217           MOVE AZHHCR OF WKAA        TO SKHHM  OF SK-ENR-DDS.
063800961217           MOVE AZMNCR OF WKAA        TO SKMNM  OF SK-ENR-DDS.
063900961217           MOVE AZSSCR OF WKAA        TO SKSSM  OF SK-ENR-DDS.
064000941012           MOVE WSTAT-AN              TO SKAN   OF SK-ENR-DDS.
064100941012           MOVE WSTAT-MOIS            TO SKMOIS OF SK-ENR-DDS.
064200941012           MOVE ZERO                  TO SKSTKO OF SK-ENR-DDS.
064300941012           MOVE "0"                   TO SKNATO OF SK-ENR-DDS.
064400941012           MOVE OLD-STK               TO SKSTKD OF SK-ENR-DDS.
064500941012           MOVE "1"                   TO SKNATD OF SK-ENR-DDS.
064600941012           COMPUTE SKSTKV OF SK-ENR-DDS = NEW-STK - OLD-STK.
064700941012           MOVE "01"                  TO SKTYPE OF SK-ENR-DDS.
064800941012           MOVE "11"                  TO SKMOTF OF SK-ENR-DDS.
064900941012           MOVE ERNORD OF ER-ENR-DDS  TO SKCID  OF SK-ENR-DDS.
065000941012           MOVE SPACES                TO SKNFAC OF SK-ENR-DDS.
065100941012           MOVE ZERO                  TO SKNPLT OF SK-ENR-DDS.
065200961217           MOVE AZAALV OF WKAA        TO SKFTAA OF SK-ENR-DDS.
065300961217           MOVE AZMMLV OF WKAA        TO SKFTMM OF SK-ENR-DDS.
065400961217           MOVE AZJJLV OF WKAA        TO SKFTJJ OF SK-ENR-DDS.
065500941012
065600941012      ******* Mise à jour article
065700941012           REWRITE AR-ENR-DDS INVALID
065800941012               MOVE "15"                       TO AAANO
065900941012               MOVE "MISE A JOUR ARTICLE IMPOSSIBLE"
066000941012                                          TO AALANO
066100941012               PERFORM ECR-ANO THRU ECR-ANO-EXIT
066200941012               GO VALID-RECEP-EXIT.
066300941012
066400941012      ******* Ecriture mise à jour de stock   erreur = moindre mal
066500941012           IF ARSTKE OF AR-ENR-DDS NOT = "F"
066600990706      *DEBUT AF0*
066700990706              PERFORM SRAFSK2O
066800990706      *FIN   AF0*
066900941012              MOVE SK-ENR-DDS TO SAVE-SK-ENR-DDS
067000941012              WRITE SK-ENR-DDS
067100941012              END-WRITE
067200941012              IF NEG-STK NOT = ZERO
067300941012                 MOVE SAVE-SK-ENR-DDS    TO SK-ENR-DDS
067400941012                 MOVE "02"     TO SKTYPE OF SK-ENR-DDS
067500941012                 COMPUTE SKSTKO OF SK-ENR-DDS = NEG-STK * -1
067600941012                 MOVE ZERO     TO SKSTKD OF SK-ENR-DDS
067700941012                 MOVE ZERO     TO SKSTKV OF SK-ENR-DDS
067800941012                 WRITE SK-ENR-DDS.
067900941012
068000941012      ******* Constitution BPFDR et écriture
068100941012           PERFORM INIT-DR THRU INIT-DR-EXIT.
068200941012           WRITE DR-ENR-DDS INVALID
068300941012               MOVE "16"                       TO AAANO
068400941012               MOVE "ECRITURE LIGNE RECEPTION IMPOSSIBLE"
068500941012                                          TO AALANO
068600941012               PERFORM ECR-ANO THRU ECR-ANO-EXIT
068700941012               GO VALID-RECEP-EXIT.
068800941012      *
068900941012           ADD   1   TO   CPT-ECR.
069000941012      *
069100941012           PERFORM   MAJ-ER   THRU    MAJ-ER-EXIT.
069200941012      *
069300941012       VALID-RECEP-EXIT.
069400941012           EXIT.
069500941012      /***************************************************************
069600941012      ******* SOUS-ROUTINE INITIALISATION DE BPFDR
069700941012      ****************************************************************
069800941012       INIT-DR.
069900941012           MOVE SPACE               TO DR-ENR-DDS.
070000941012           MOVE ERTYRC OF ER-ENR-DDS TO DRTYRC OF DR-ENR-DDS.
070100941012           MOVE ERCIDR OF ER-ENR-DDS TO DRCIDR OF DR-ENR-DDS.
070200941012           MOVE ERKAPP OF ER-ENR-DDS TO DRKAPP OF DR-ENR-DDS.
070300941012           MOVE ERKDEP OF ER-ENR-DDS TO DRKDEP OF DR-ENR-DDS.
070400941012           MOVE ERKRAY OF ER-ENR-DDS TO DRKRAY OF DR-ENR-DDS.
070500941012           MOVE ERKSEC OF ER-ENR-DDS TO DRKSEC OF DR-ENR-DDS.
070600941012           MOVE ERCNUL OF ER-ENR-DDS TO DRCNUL OF DR-ENR-DDS.
070700941012           MOVE ERNENT OF ER-ENR-DDS TO DRNENT OF DR-ENR-DDS.
070800941012           MOVE ERCID  OF ER-ENR-DDS TO DRCID  OF DR-ENR-DDS.
070900941012           MOVE ERAARC OF ER-ENR-DDS TO DRAARC OF DR-ENR-DDS.
071000941012           MOVE ERMMRC OF ER-ENR-DDS TO DRMMRC OF DR-ENR-DDS.
071100941012           MOVE ERJJRC OF ER-ENR-DDS TO DRJJRC OF DR-ENR-DDS.
071200941012           MOVE ERNORD OF ER-ENR-DDS TO DRNORD OF DR-ENR-DDS.
071300941012           STRING "0" ARRAC OF AR-ENR-DDS
071400941012                 DELIMITED BY SIZE INTO DRSLIM OF DR-ENR-DDS.
071500941012           MOVE ARMOD  OF AR-ENR-DDS TO DRMOD  OF DR-ENR-DDS.
071600941012           MOVE DR-QT                TO DRQTE  OF DR-ENR-DDS.
071700941012           MOVE ARPA   OF AR-ENR-DDS TO DRPA   OF DR-ENR-DDS.
071800941012           MOVE ZERO                 TO DRPV   OF DR-ENR-DDS.
071900941012           MOVE ARTVA OF AR-ENR-DDS  TO WTVA-FIC.
072000941012           IF WTVA-FIC NOT NUMERIC
072100941012                       MOVE "00" TO ARTVA OF AR-ENR-DDS
072200941012                       SET IN-TVA TO 1
072300941012           ELSE SET IN-TVA TO 1
072400941012                SET IN-TVA UP BY WTVA-FIC9
072500941012                IF WK-TVA-TP (IN-TVA) = SPACE
072600941012                       MOVE "00" TO ARTVA OF AR-ENR-DDS
072700941012                       SET IN-TVA TO 1.
072800941012           MOVE ARTVA OF AR-ENR-DDS  TO DRTVA  OF DR-ENR-DDS.
072900941012           IF DR-QT < 0
073000941012                MOVE "02"             TO DRRET  OF DR-ENR-DDS
073100941012           ELSE MOVE "01"             TO DRRET  OF DR-ENR-DDS.
073200941012           MOVE ARRGVI OF AR-ENR-DDS  TO DRRGVI OF DR-ENR-DDS.
073300941012           MOVE ARRGDR OF AR-ENR-DDS  TO DRRGDR OF DR-ENR-DDS.
073400941012           MOVE ARCNUF OF AR-ENR-DDS  TO DRCNUF OF DR-ENR-DDS.
073500941012           MOVE ARCIP  OF AR-ENR-DDS  TO DRCIP  OF DR-ENR-DDS.
073600941012           MOVE ARVA   OF AR-ENR-DDS  TO DRVA   OF DR-ENR-DDS.
073700941012           MOVE ARPCB  OF AR-ENR-DDS  TO DRPCB  OF DR-ENR-DDS.
073800941012           MOVE ARFAM  OF AR-ENR-DDS  TO DRFAM  OF DR-ENR-DDS.
073900941012           MOVE ARSFA  OF AR-ENR-DDS  TO DRSFA  OF DR-ENR-DDS.
074000941012           MOVE ARCAT  OF AR-ENR-DDS  TO DRCAT  OF DR-ENR-DDS.
074100941012           MOVE "01"                  TO DRGST  OF DR-ENR-DDS.
074200941012           MOVE ARTYAR OF AR-ENR-DDS  TO DRTART OF DR-ENR-DDS.
074300941012           MOVE ARLCON OF AR-ENR-DDS  TO DRLCON OF DR-ENR-DDS.
074400941012           MOVE ARRIST OF AR-ENR-DDS  TO DRRIST OF DR-ENR-DDS.
074500941012           MOVE ARCRIS OF AR-ENR-DDS  TO DRCRIS OF DR-ENR-DDS.
074600941012           MOVE ARCOOP OF AR-ENR-DDS  TO DRCOOP OF DR-ENR-DDS.
074700941012           MOVE ARCCOO OF AR-ENR-DDS  TO DRCCOO OF DR-ENR-DDS.
074800941012           MOVE ZERO                  TO DRNEG  OF DR-ENR-DDS.
074900941012           MOVE SPACE                 TO DRCNEG OF DR-ENR-DDS.
075000941012           IF FRCODR OF ZPRFR = "0"
075100941012                MOVE ZERO             TO DRRF   OF DR-ENR-DDS
075200941012                MOVE SPACE            TO DRCRF  OF DR-ENR-DDS
075300941012           ELSE IF FRCODR OF ZPRFR = "2"
075400941012                MOVE FRFONC OF ZPRFR  TO DRRF   OF DR-ENR-DDS
075500941012                MOVE SPACE            TO DRCRF  OF DR-ENR-DDS
075600941012           ELSE MOVE ARRF  OF AR-ENR-DDS  TO DRRF  OF DR-ENR-DDS
075700941012                MOVE ARCRF OF AR-ENR-DDS  TO DRCRF OF DR-ENR-DDS.
075800941012           IF ARPANT OF AR-ENR-DDS NUMERIC
075900941012                STRING "0" ARPANT OF AR-ENR-DDS DELIMITED BY SIZE
076000941012                                        INTO DRAVDF OF DR-ENR-DDS
076100941012           ELSE MOVE ZEROES TO DRAVDF OF DR-ENR-DDS.
076200941012           MOVE ARPAB OF AR-ENR-DDS   TO DRTAX1 OF DR-ENR-DDS.
076300941012           MOVE ARPR  OF AR-ENR-DDS   TO DRTAX2 OF DR-ENR-DDS.
076400941012           MOVE ARTRS OF AR-ENR-DDS   TO DRTRSP OF DR-ENR-DDS.
076500941012           MOVE WNO-SEMAINE           TO DRTOP1 OF DR-ENR-DDS.
076600941012           MOVE ARNENT OF AR-ENR-DDS  TO DRTOP3 OF DR-ENR-DDS.
076700941012           MOVE ARTOP3 OF AR-ENR-DDS  TO DRTOP4 OF DR-ENR-DDS.
076800941012           COMPUTE WQTE  ROUNDED = DRQTE  OF DR-ENR-DDS.
076900941012           COMPUTE WMPA  ROUNDED = DRPA   OF DR-ENR-DDS * WQTE.
077000941012           COMPUTE WMPAB ROUNDED = DRTAX1 OF DR-ENR-DDS * WQTE.
077100941012           COMPUTE WMPR  ROUNDED = DRTAX2 OF DR-ENR-DDS * WQTE.
077200941012           COMPUTE WMTVA ROUNDED = WMPA * WK-TVA-TVATL-CENT (IN-TVA).
077300941012           MOVE WMTVA                 TO DRTAX  OF DR-ENR-DDS.
077400941012           COMPUTE WMVIG ROUNDED = DRRGVI OF DR-ENR-DDS * WQTE.
077500941012      ****** SI PAS EMBALLAGES
077600941012           IF DRFAM OF DR-ENR-DDS NOT = "099"
077700941012              IF DRCRF  OF DR-ENR-DDS = SPACE
077800941012                 COMPUTE WMRF  ROUNDED = DRRF   OF DR-ENR-DDS * WMPA
077900941012                                        / 100
078000941012              ELSE
078100941012                 COMPUTE WMRF  ROUNDED = DRRF   OF DR-ENR-DDS * WQTE
078200941012              END-IF
078300941012              COMPUTE WMPA-RF ROUNDED = WMPA - WMRF
078400941012              IF DRCRIS OF DR-ENR-DDS = SPACE
078500941012                 COMPUTE WMRIS ROUNDED = DRRIST OF DR-ENR-DDS * WMPA-RF
078600941012                                        / 100
078700941012              ELSE
078800941012                 COMPUTE WMRIS ROUNDED = DRRIST OF DR-ENR-DDS * WQTE
078900941012              END-IF
079000941012              IF DRCCOO OF DR-ENR-DDS = SPACE
079100941012                 COMPUTE WMCOO ROUNDED = DRCOOP OF DR-ENR-DDS * WMPA-RF
079200941012                                        / 100
079300941012              ELSE
079400941012                 COMPUTE WMCOO ROUNDED = DRCOOP OF DR-ENR-DDS * WQTE
079500941012              END-IF
079600941012              IF DRCNEG OF DR-ENR-DDS = SPACE
079700941012                 COMPUTE WMNEG ROUNDED = DRNEG  OF DR-ENR-DDS * WMPA-RF
079800941012                                        / 100
079900941012              ELSE
080000941012                 COMPUTE WMNEG ROUNDED = DRNEG  OF DR-ENR-DDS * WQTE
080100941012              END-IF.
080200941012           COMPUTE WMRGD ROUNDED = DRRGDR OF DR-ENR-DDS * WQTE.
080300941012           COMPUTE WMTRS ROUNDED = DRTRSP OF DR-ENR-DDS * WQTE.
080400941012           COMPUTE WMTVT ROUNDED = WMTRS * WK-TVA-TVATL-CENT (IN-TVA).
080500941012       INIT-DR-EXIT.
080600941012           EXIT.
080700941012      /
080800941012      ****************************************************************
080900941012      ******* SOUS-ROUTINE MAJ DES CUMULS DANS BPFER
081000941012      ****************************************************************
081100941012       MAJ-ER.
081200941012           ADD 1                      TO ERNLIG OF ER-ENR-DDS.
081300941012           ADD WMPA                   TO ERMPA  OF ER-ENR-DDS.
081400941012           ADD WMPAB                  TO ERMTX1 OF ER-ENR-DDS.
081500941012           ADD WMPR                   TO ERMTX2 OF ER-ENR-DDS.
081600941012           ADD WMTVA                  TO ERMTVA OF ER-ENR-DDS.
081700941012           ADD WMVIG                  TO ERMVIG OF ER-ENR-DDS.
081800941012      ****** CAS DES EMBALLAGES
081900941012           IF DRFAM OF DR-ENR-DDS = "099"
082000941012                    ADD WMPA          TO ERMEMB OF ER-ENR-DDS
082100941012           ELSE
082200941012                    ADD WMCOO         TO ERMCOO OF ER-ENR-DDS
082300941012                                         ERMAVD OF ER-ENR-DDS
082400941012                    ADD WMRIS         TO ERMRIS OF ER-ENR-DDS
082500941012                                         ERMAVD OF ER-ENR-DDS
082600941012                    ADD WMNEG         TO ERMNEG OF ER-ENR-DDS
082700941012                                         ERMAVD OF ER-ENR-DDS
082800941012                    ADD WMRF          TO ERMRF  OF ER-ENR-DDS.
082900941012           ADD WMRGD                  TO ERMRGD OF ER-ENR-DDS.
083000941012           ADD WMTRS                  TO ERMTRS OF ER-ENR-DDS.
083100941012           ADD WMTVT                  TO ERMTVT OF ER-ENR-DDS.
083200941012       MAJ-ER-EXIT.
083300941012           EXIT.
083400941012      /
083500941012       MAJ-ENT-REC.
083600941012           WRITE ER-ENR-DDS INVALID
083700941012               MOVE VRAI TO TOP-ENTERR
083800941012               MOVE "11"                          TO AAANO
083900941012               MOVE "ERREUR ECRITURE ENT. RECEP." TO AALANO
084000941012               PERFORM ECR-ANO THRU ECR-ANO-EXIT.
084100941012       MAJ-ENT-REC-EXIT.
084200941012           EXIT.
084300990705      *
084400990705      *DEBUT AF0*
084500990705           COPY SRAFER2O.
084600990706           COPY SRAFSK2O.
084700990705      *FIN   AF0*
084800990705      *
084900941012
