000100870421      ****************************************************************
000200000727      * APPLICATION NAME...........: . ALL APPLICATIONS              *
000300000727      * COPY NAME..................: . SRLTVA                        *
000400000727      * TYPE OF COPY...............: . SUB-ROUTINE   (PERFORM)       *
000500000727      * FUNCTION...................: . LOAD TAX RATE TABLE           *
000600000727      * OTHER COPIES REQUITRED.....: . IN WORKING WKTABTVA           *
000700870526      *         .                                 WKMESSAGE          *
000800970605      *                                                              *
000900000727      *  LAST MODIFICATION DATE.....: 05/06/97 BY JNF                *
001000000727      *  LAST MODIFICATION SUBJECT..: CORRESPONDANCE TAX CODE FOR    *
001100000727      *                                  TWO SITES                   *
001200970605      *                                                              *
001300870421      ****************************************************************
001400871102       SRL-TVA.
001500880812           MOVE WK-TVA-CLE  TO INFCLE.
001600870525           START   FINFODI  KEY   >    INFCLE    INVALID   KEY
001700870526                   STRING "ERREUR LECTURE F-INFODI CLE :"  INFCLE
001800870526                          DELIMITED BY  SIZE     INTO WK-MESSAGE-LIB
001900871102                          GO      TO             SRL-TVA-F.
002000871102       SRL-LECT-TVA.
002100880812           READ    FINFODI  NEXT  END  GO SRL-TVA-F.
002200880812           IF INF-CLE-RAC18 NOT = WK-TVA-RAC GO SRL-TVA-F.
002300871108           IF INF-CLE-SEQENR NOT NUMERIC
002400880812                MOVE "CODE TVA INVALIDE" TO WK-MESSAGE-LIB
002500871103                GO   TILT.
002600871108           IF INF-CLE-SEQENR9 NOT < WK-TVA-NBPST
002700880812                MOVE "TAILLE TABLE T.V.A. INSUFFISANTE"
002800871103                     TO WK-MESSAGE-LIB
002900871103                GO   TILT.
003000871103           SET IN-TVA TO 1
003100871103           SET IN-TVA UP BY INF-CLE-SEQENR9.
003200890612           IF FDIN-TVA-LIB = SPACE
003300890612                STRING "CODE TVA " INF-CLE-SEQENR
003400890612                       DELIMITED BY SIZE INTO FDIN-TVA-LIB.
003500880812           MOVE FDIN-TVA-LIB       TO WK-TVA-LIB   (IN-TVA).
003600880812           MOVE FDIN-TVA-TVAT      TO WK-TVA-TVAT  (IN-TVA).
003700880812           MOVE FDIN-TVA-TVATL     TO WK-TVA-TVATL (IN-TVA).
003800880812           MOVE FDIN-TVA-TVAE      TO WK-TVA-TVAE  (IN-TVA).
003900880812           MOVE FDIN-TVA-TVAM      TO WK-TVA-TVAM  (IN-TVA).
004000880812           MOVE FDIN-TVA-TVAML     TO WK-TVA-TVAML (IN-TVA).
004100880812           MOVE FDIN-TVA-TVVT      TO WK-TVA-TVVT  (IN-TVA).
004200880812           MOVE FDIN-TVA-TVVTL     TO WK-TVA-TVVTL (IN-TVA).
004300880812           MOVE FDIN-TVA-TVVE      TO WK-TVA-TVVE  (IN-TVA).
004400880812           MOVE FDIN-TVA-TVVM      TO WK-TVA-TVVM  (IN-TVA).
004500880812           MOVE FDIN-TVA-TVVML     TO WK-TVA-TVVML (IN-TVA).
004600900615           MOVE FDIN-TVA-ACTIF     TO WK-TVA-ACTIF (IN-TVA).
004700900615           MOVE FDIN-TVA-REGIE     TO WK-TVA-REGIE (IN-TVA).
004800970605           MOVE FDIN-TVA-CORRES    TO WK-TVA-CORRES (IN-TVA).
004900991026M01?V      MOVE INF-MAJ-DATE       TO WK-TVA-DATE.
005000880812           MOVE INF-MSG            TO WK-TVA-NMSG.
005100871111           GO SRL-LECT-TVA.
005200871102       SRL-TVA-F.
005300991026M01?V      IF      WK-TVA-TABLE     =   SPACE
005400880812                   MOVE "ERREUR INFODI ... TABLE TVA  VIDE"
005500870612                             TO         WK-MESSAGE-LIB
005600870612                             GO         TILT.
005700871103           SET IN-TVA TO 1.
005800871103       SRL-TVA-CONSTIT.
005900871103           IF WK-TVA-TP (IN-TVA) NOT = SPACE
006000871103                  SET INF-CLE-SEQENR9 TO IN-TVA
006100871210                  STRING WK-TVA-VMSG DELIMITED BY SPACE
006200871103                         INF-CLE-SEQENR DELIMITED BY SIZE
006300871210                     INTO WK-TVA-VMSG.
006400871103           IF IN-TVA < WK-TVA-NBPST SET IN-TVA UP BY 1
006500871103                                    GO SRL-TVA-CONSTIT.
006600871210           SET     IN-TMSG              TO  1.
006700871210           SEARCH  WK-TMSG-PST          VARYING   IN-TMSG
006800871210                   WHEN     WK-TVA-NMSG   =     WK-TMSG-NO (IN-TMSG)
006900871210                      MOVE WK-TVA-VMSG TO WK-TMSG-LIB(IN-TMSG).
007000871102       SRL-TVA-FIN.
007100870525           EXIT.
007200871102       SRL-TVA-END.
