000100000000      ***************************************************************
000200000727      *    PROGRAM MESSAGE         ---   FOR MESSAGES               *
000300000727      *                                      DISPLAYS               *
000400000000      *                                      PRINTS                 *
000500000000      *                                      DUMPS      ETC...      *
000600000000      *                                                             *
000700880105      *  COPY WKREFPGM REPLACING SPACE BY "aCBxxyyy*v*".            *
000800000000      ***************************************************************
000900000000       01  REF-PGM    VALUE SPACE.
001000000000           05  PGM             PIC X(8).
001100000000           05  FILLER          PIC X.
001200000000           05  VERSION         PIC X.
001300000000           05  FILLER          PIC X.
