000100150717             PGM
000200030704             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) VALUE('TH_SMPL')
000300030704             CPYF       FROMFILE(ARTICLE) TOFILE(&LIB/ARTICLESAV)
000301160217             /* change Project1 */
000400020131/* */
000500020131ENDPGM
