000100000527     D Addition        PR            15P 5
000200000725     DFacteur1                       15P 5
000300000725     DFacteur2                       15P 5
