000100000724     DMultiplica       PR            20P 5
000200000724     DFacteur1                       15P 5
000300000724     DFacteur2                       15P 5
000400000724     Ddivide           PR            20P 5
000500000724     DFacteur1                       15P 5
000600000724     DFacteur2                       15P 5
000700000724     DRemainder                      15P 5 OPTIONS(*NOPASS)
