000100000527     HNOMAIN
000200000605      /COPY MOD002_P
000300000527     P Addition        B                   EXPORT
000400000527     D                 PI            15P 5
000500000527     DFacteur1                       15P 5
000600000527     DFacteur2                       15P 5
000700000527     D*
000800000527     DResultat         S             15P 5
000900000527     C                   EVAL      Resultat = Facteur1 + Facteur2
001000000527     C                   return    Resultat
001100000527     P Addition        E
