000100051123     D*------------------------------------------------------------------------
000200051123     D* Get_RandInt : get a random integer
000300051123     D*------------------------------------------------------------------------
000400051123     D Get_RandInt     Pr            10i 0
000500051123     D  e_IntMax                     10i 0 Value
000600051123     D
000700051123
