000100051123     D
000200051123     D*------------------------------------------------------------------------
000300051123     D* Prototype for procedure SMK28X1 in CLLE
000400051123     D*------------------------------------------------------------------------
000500051123     D SMK28X1         Pr
000600051123     D*
000700051123     D e_SysValNam                   10a
000800051123     D e_Value                     5000a
000900051123     D*--------
001000051123
