000100051123     D*------------------------------------------------------------------------
000200051123     D* Prototypes for Procedures for UpperCase/LowerCase Strings
000300051123     D*------------------------------------------------------------------------
000400051123     D*------------------------------------------------------------------------
000500051123     D* Str_ToUpper : Convert a string to Uppercase
000600051123     D*     (max length = 100 char)
000700051123     D*------------------------------------------------------------------------
000800051123     D Str_ToUpper     Pr           100A
000900051123     D e_String                     100a   Const
001000051123     D*--------
001100051123     D*------------------------------------------------------------------------
001200051123     D* Str_ToLower : Convert a string to Uppercase
001300051123     D*     (max length = 100 char)
001400051123     D*------------------------------------------------------------------------
001500051123     D Str_ToLower     Pr           100A
001600051123     D e_String                     100a   Const
001700051123     D*--------
001800051123     D*------------------------------------------------------------------------
001900051123     D* Str_isUpper : Check whether a String is only in UpperCase
002000051123     D*------------------------------------------------------------------------
002100051123     D Str_isUpper     Pr             1N
002200051123     D e_String                     100a   Const
002300051123     D*--------
002400051123     D*------------------------------------------------------------------------
002500051123     D* Str_isLower : Check whether a String is only in UpperCase
002600051123     D*------------------------------------------------------------------------
002700051123     D Str_isLower     Pr             1N
002800051123     D e_String                     100a   Const
002900051123     D*--------
