000100870421     A                                      UNIQUE
000200870924     A          R APRIN                     PFILE(APFIN)
000300870511     A          K INFCLE
