000100000726     A                                      UNIQUE
000200000726     A          R APRCC
000300000726     A            CECRA      00010A  B
000400000727     A
000500000726     A                                      TEXT('VEROUILLAGE ECRAN')
000600000726     A                                      COLHDG( +
000700000726     A                                      'NOM ECRAN' +
000800000726     A                                      )
000900000726     A            CSTTS      00001A  B
001000000727     A
001100000726     A                                      TEXT('Status enreg 0 = INACTIF')
001200000726     A                                      COLHDG( +
001300000726     A                                      'ST' +
001400000726     A                                      )
001500000726     A            CCNUD      00003A  B
001600000727     A
001700000726     A                                      TEXT('CNUD   (INF:XXCNUD  )')
001800000726     A                                      COLHDG( +
001900000726     A                                      'CNUD' +
002000000726     A                                      )
002100000726     A            CCID       00005A  B
002200000727     A
002300000726     A                                      TEXT('CENTRE D''ACTIVITE')
002400000726     A                                      COLHDG( +
002500000726     A                                      'CID' +
002600000726     A                                      )
002700000726     A            CCIDA      00005A  B
002800000727     A
002900000726     A                                      TEXT('Ancien CID')
003000000726     A                                      COLHDG( +
003100000726     A                                      'Ancien' +
003200000726     A                                      'CID' +
003300000726     A                                      )
003400000726     A            CCIDN      00005A  B
003500000727     A
003600000726     A                                      TEXT('Nouveau CID')
003700000726     A                                      COLHDG( +
003800000726     A                                      'Nouveau' +
003900000726     A                                      'CID' +
004000000726     A                                      )
004100000726     A            CCAT       00001A  B
004200000727     A
004300000726     A                                      TEXT('CAT 1 pos: déterminé par I')
004400000726     A                                      COLHDG( +
004500000726     A                                      'ZCAT' +
004600000726     A                                      )
004700000726     A            COPTIQ     00001A  B
004800000727     A
004900000726     A                                      TEXT('Lect optiq cais: 0=NON 1=O')
005000000726     A                                      COLHDG( +
005100000726     A                                      'LECT' +
005200000726     A                                      'OPTIQ' +
005300000726     A                                      'CAISSE' +
005400000726     A                                      )
005500000726     A            CREG       00002A  B
005600000727     A
005700000726     A                                      TEXT('REGION GEO.  (INF: XXRGE')
005800000726     A                                      COLHDG( +
005900000726     A                                      'RGEO' +
006000000726     A                                      )
006100000726     A            CSECT      00002A  B
006200000727     A
006300000726     A                                      TEXT('Code secteur Magasin')
006400000726     A                                      COLHDG( +
006500000726     A                                      'SECT' +
006600000726     A                                      'MAG' +
006700000726     A                                      )
006800000726     A            CABREV     00006A  B
006900000727     A
007000000726     A                                      TEXT('Abréviation')
007100000726     A                                      COLHDG( +
007200000726     A                                      'ABRV' +
007300000726     A                                      )
007400000726     A            CSIGL      00003A  B
007500000727     A
007600000726     A                                      TEXT('Sigle')
007700000726     A                                      COLHDG( +
007800000726     A                                      'SIGL' +
007900000726     A                                      )
008000000726     A            CTOUR      00002A  B
008100000727     A
008200000726     A                                      TEXT('N° tournée =======> PLANNI')
008300000726     A                                      COLHDG( +
008400000726     A                                      'ZTN' +
008500000726     A                                      )
008600000726     A            CQUAI      00003A  B
008700000727     A
008800000726     A                                      TEXT('N° porte   =======> PLANNI')
008900000726     A                                      COLHDG( +
009000000726     A                                      'PRTE' +
009100000726     A                                      )
009200000726     A            CULV       00001A  B
009300000727     A
009400000726     A                                      TEXT('Unité de livr : 1=PCB  2=U')
009500000726     A                                      COLHDG( +
009600000726     A                                      'UNITE' +
009700000726     A                                      'LIVR.' +
009800000726     A                                      )
009900000726     A            CPLV       00001A  B
010000000727     A
010100000726     A                                      TEXT('Possib. livr. : 1=PAL  2=R')
010200000726     A                                      COLHDG( +
010300000726     A                                      'POSSIB' +
010400000726     A                                      'LIVR.' +
010500000726     A                                      )
010600000726     A            CFRT       00001A  B
010700000727     A
010800000726     A                                      TEXT('Freinte ?  : 0=NON 1=OUI')
010900000726     A                                      COLHDG( +
011000000726     A                                      'FREINTE ?' +
011100000726     A                                      )
011200000726     A            CASS1      00001A  B
011300000727     A
011400000728     A                                      TEXT('Assort.ray 1. : "0" Y "9"')
011500000726     A                                      COLHDG( +
011600000726     A                                      'ASS' +
011700000726     A                                      'RAY 1' +
011800000726     A                                      )
011900000726     A            CASS2      00001A  B
012000000727     A
012100000728     A                                      TEXT('Assort.ray 2. : "0" Y "9"')
012200000726     A                                      COLHDG( +
012300000726     A                                      'ASS' +
012400000726     A                                      'RAY 2' +
012500000726     A                                      )
012600000726     A            CASS3      00001A  B
012700000727     A
012800000728     A                                      TEXT('Assort.ray 3. : "0" Y "9"')
012900000726     A                                      COLHDG( +
013000000726     A                                      'ASS' +
013100000726     A                                      'RAY 3' +
013200000726     A                                      )
013300000726     A            CASS4      00001A  B
013400000727     A
013500000728     A                                      TEXT('Assort.ray 4. : "0" Y "9"')
013600000726     A                                      COLHDG( +
013700000726     A                                      'ASS' +
013800000726     A                                      'RAY 4' +
013900000726     A                                      )
014000000726     A            CASS5      00001A  B
014100000727     A
014200000728     A                                      TEXT('Assort.ray 5. : "0" Y "9"')
014300000726     A                                      COLHDG( +
014400000726     A                                      'ASS' +
014500000726     A                                      'RAY 5' +
014600000726     A                                      )
014700000726     A            CASS6      00001A  B
014800000727     A
014900000728     A                                      TEXT('Assort.ray 6. : "0" Y "9"')
015000000726     A                                      COLHDG( +
015100000726     A                                      'ASS' +
015200000726     A                                      'RAY 6' +
015300000726     A                                      )
015400000726     A            CZP1       00001A  B
015500000727     A
015600000728     A                                      TEXT('ZP.ray 1: "0" Y "9" >>>>>S')
015700000726     A                                      COLHDG( +
015800000726     A                                      'ZP' +
015900000726     A                                      'RAY 1' +
016000000726     A                                      )
016100000726     A            CZP2       00001A  B
016200000727     A
016300000728     A                                      TEXT('ZP.ray 2: "0" Y "9" >>>>>S')
016400000726     A                                      COLHDG( +
016500000726     A                                      'ZP' +
016600000726     A                                      'RAY 2' +
016700000726     A                                      )
016800000726     A            CZP3       00001A  B
016900000727     A
017000000728     A                                      TEXT('ZP.ray 3: "0" Y "9" >>>>>S')
017100000726     A                                      COLHDG( +
017200000726     A                                      'ZP' +
017300000726     A                                      'RAY 3' +
017400000726     A                                      )
017500000726     A            CZP4       00001A  B
017600000727     A
017700000728     A                                      TEXT('ZP.ray 4: "0" Y "9" >>>>>S')
017800000726     A                                      COLHDG( +
017900000726     A                                      'ZP' +
018000000726     A                                      'RAY 4' +
018100000726     A                                      )
018200000726     A            CZP5       00001A  B
018300000727     A
018400000728     A                                      TEXT('ZP.ray 5: "0" Y "9" >>>>>S')
018500000726     A                                      COLHDG( +
018600000726     A                                      'ZP' +
018700000726     A                                      'RAY 5' +
018800000726     A                                      )
018900000726     A            CZP6       00001A  B
019000000727     A
019100000728     A                                      TEXT('ZP.ray 6: "0" Y "9" >>>>>S')
019200000726     A                                      COLHDG( +
019300000726     A                                      'ZP' +
019400000726     A                                      'RAY 6' +
019500000726     A                                      )
019600000726     A            CCESS      00004A  B
019700000727     A
019800000726     A                                      TEXT('% cess.cli.ext. >>>>>>>>>S')
019900000726     A                                      COLHDG( +
020000000726     A                                      '% CESS' +
020100000726     A                                      'CLI.EXT' +
020200000726     A                                      )
020300000726     A            CTRPLU     00002A  B
020400000727     A
020500000726     A                                      TEXT('Crit transp lundi =>PLANNI')
020600000726     A                                      COLHDG( +
020700000726     A                                      'CRIT' +
020800000726     A                                      'TRANSP' +
020900000726     A                                      'LUNDI' +
021000000726     A                                      )
021100000726     A            CTRPMA     00002A  B
021200000727     A
021300000726     A                                      TEXT('Crit transp mardi =>PLANNI')
021400000726     A                                      COLHDG( +
021500000726     A                                      'CRIT' +
021600000726     A                                      'TRANSP' +
021700000726     A                                      'MARDI' +
021800000726     A                                      )
021900000726     A            CTRPME     00002A  B
022000000727     A
022100000726     A                                      TEXT('Crit transp mercre=>PLANNI')
022200000726     A                                      COLHDG( +
022300000726     A                                      'CRIT' +
022400000726     A                                      'TRANSP' +
022500000726     A                                      'MERCREDI' +
022600000726     A                                      )
022700000726     A            CTRPJE     00002A  B
022800000727     A
022900000726     A                                      TEXT('Crit transp jeudi =>PLANNI')
023000000726     A                                      COLHDG( +
023100000726     A                                      'CRIT' +
023200000726     A                                      'TRANSP' +
023300000726     A                                      'JEUDI' +
023400000726     A                                      )
023500000726     A            CTRPVE     00002A  B
023600000727     A
023700000726     A                                      TEXT('Crit transp vendre=>PLANNI')
023800000726     A                                      COLHDG( +
023900000726     A                                      'CRIT' +
024000000726     A                                      'TRANSP' +
024100000726     A                                      'VENDREDI' +
024200000726     A                                      )
024300000726     A            CTRPSA     00002A  B
024400000727     A
024500000726     A                                      TEXT('Crit transp samedi=>PLANNI')
024600000726     A                                      COLHDG( +
024700000726     A                                      'CRIT' +
024800000726     A                                      'TRANSP' +
024900000726     A                                      'SAMEDI' +
025000000726     A                                      )
025100000726     A            CSOCG      00002A  B
025200000727     A
025300000726     A                                      TEXT('Société (INF:XXSTE   )')
025400000726     A                                      COLHDG( +
025500000726     A                                      'STE' +
025600000726     A                                      )
025700000726     A            CORDI      00001A  B
025800000727     A
025900000726     A                                      TEXT('Ordinateur ? : 0=NON 1=OUI')
026000000726     A                                      COLHDG( +
026100000726     A                                      'ORDINATEUR ?' +
026200000726     A                                      )
026300000726     A            CENTRP     00005A  B
026400000727     A
026500000726     A                                      TEXT('Entrepot PGC')
026600000726     A                                      COLHDG( +
026700000726     A                                      'ENTREPOT' +
026800000726     A                                      )
026900000726     A            CNENTP     00002A  B
027000000727     A
027100000726     A                                      TEXT('N° entrepot PGC ctrl APFEN')
027200000726     A                                      COLHDG( +
027300000726     A                                      'NO' +
027400000726     A                                      'ENT' +
027500000726     A                                      'SEC' +
027600000726     A                                      )
027700000726     A            CENTRF     00005A  B
027800000727     A
027900000726     A                                      TEXT('Entrepot FRAIS')
028000000726     A                                      COLHDG( +
028100000726     A                                      'ENTREPOT' +
028200000726     A                                      )
028300000726     A            CNENTF     00002A  B
028400000727     A
028500000726     A                                      TEXT('N° entrepot FRAIS ctrl APF')
028600000726     A                                      COLHDG( +
028700000726     A                                      'NO' +
028800000726     A                                      'ENT' +
028900000726     A                                      'SEC' +
029000000726     A                                      )
029100000726     A            CGART      00005A  B
029200000727     A
029300000726     A                                      TEXT('GROUPE MAGASIN FRAIS')
029400000726     A                                      COLHDG( +
029500000726     A                                      'GART' +
029600000726     A                                      )
029700000726     A            CZPSP      00003A  B
029800000726     A                                      DFT('***')
029900000727     A
030000000728     A                                      TEXT('ZP spéciale  (000 Y 030)')
030100000726     A                                      COLHDG( +
030200000726     A                                      'ZP' +
030300000726     A                                      'SPEC' +
030400000726     A                                      )
030500000726     A            CZPLE      00002A  B
030600000726     A                                      DFT('**')
030700000727     A
030800000728     A                                      TEXT('Zone de prix LE : 00 Y 15')
030900000726     A                                      COLHDG( +
031000000726     A                                      'ZP' +
031100000726     A                                      )
031200000726     A            CZPLD      00002A  B
031300000727     A
031400000728     A                                      TEXT('Zone de prix LD : 00 Y 15')
031500000726     A                                      COLHDG( +
031600000726     A                                      'ZP' +
031700000726     A                                      )
031800000726     A            CTRANS     00002A  B
031900000727     A
032000000726     A                                      TEXT('N° zone transport==>PLANNI')
032100000726     A                                      COLHDG( +
032200000726     A                                      'ZONE' +
032300000726     A                                      'TRANSP' +
032400000726     A                                      )
032500000726     A            CETIQ      00001A  B
032600000727     A
032700000726     A                                      TEXT('Etiquettes ? : 0=NON 1=OUI')
032800000726     A                                      COLHDG( +
032900000726     A                                      'ETIQUETTE ?' +
033000000726     A                                      )
033100000726     A            CDOPTI     00001A  B
033200000727     A
033300000726     A                                      TEXT('Commande optiq : 0=NON 1=O')
033400000726     A                                      COLHDG( +
033500000726     A                                      'COMMANDE' +
033600000726     A                                      'OPTIQUE' +
033700000726     A                                      )
033800000726     A            CTMARG     00001A  B
033900000727     A
034000000726     A                                      TEXT('Type fact: 1=TPL 2=CES 3=E')
034100000726     A                                      COLHDG( +
034200000726     A                                      'TYPE' +
034300000726     A                                      'FACT' +
034400000726     A                                      )
034500000726     A            CCATT      00002A  B
034600000727     A
034700000726     A                                      TEXT('Catég fact (INF:ENART  TPL')
034800000726     A                                      COLHDG( +
034900000726     A                                      'CAPL' +
035000000726     A                                      )
035100000726     A            CCATM      00002A  B
035200000727     A
035300000726     A                                      TEXT('CAT STAT')
035400000726     A                                      COLHDG( +
035500000726     A                                      'CAT' +
035600000726     A                                      'STAT' +
035700000726     A                                      )
035800000726     A            CHD        00002A  B
035900000727     A
036000000726     A                                      TEXT('Type HD : 1=HD1 2=HD2 3=HY')
036100000726     A                                      COLHDG( +
036200000726     A                                      'TYPE' +
036300000726     A                                      'HD' +
036400000726     A                                      )
036500000726     A            CPVZP      00002A  B
036600000726     A                                      DFT('**')
036700000727     A
036800000726     A                                      TEXT('JOIN PV: ZP si pas de PVS')
036900000726     A                                      COLHDG( +
037000000726     A                                      'ZP' +
037100000726     A                                      )
037200000726     A            CPVZPS     00003A  B
037300000726     A                                      DFT('***')
037400000727     A
037500000726     A                                      TEXT('JOIN PV: ZPS si un PVS')
037600000726     A                                      COLHDG( +
037700000726     A                                      'ZP' +
037800000726     A                                      'SPEC' +
037900000726     A                                      )
038000000726     A            CTEL       00015A  B
038100000727     A
038200000726     A                                      TEXT('Téléphone')
038300000726     A                                      COLHDG( +
038400000726     A                                      'TEL' +
038500000726     A                                      )
038600000726     A            CTLXI      00007A  B
038700000727     A
038800000726     A                                      TEXT('TELEX INDICATIF')
038900000726     A                                      COLHDG( +
039000000726     A                                      'TLXI' +
039100000726     A                                      )
039200000726     A            CTLXN      00006A  B
039300000727     A
039400000726     A                                      TEXT('TELEX NUMERO')
039500000726     A                                      COLHDG( +
039600000726     A                                      'TLXN' +
039700000726     A                                      )
039800000726     A            CAAC       00002A  B
039900000727     A
040000000726     A                                      TEXT('ANNEE CREATION')
040100000726     A                                      COLHDG( +
040200000726     A                                      'AAC' +
040300000726     A                                      )
040400000726     A            CMMC       00002A  B
040500000727     A
040600000726     A                                      TEXT('MOIS CREATION')
040700000726     A                                      COLHDG( +
040800000726     A                                      'MMC' +
040900000726     A                                      )
041000000726     A            CJJC       00002A  B
041100000727     A
041200000726     A                                      TEXT('JOUR CREATION')
041300000726     A                                      COLHDG( +
041400000726     A                                      'JJC' +
041500000726     A                                      )
041600000726     A            CAAM       00002A  B
041700000727     A
041800000726     A                                      TEXT('ANNEE MODIF')
041900000726     A                                      COLHDG( +
042000000726     A                                      'ANNEE' +
042100000726     A                                      'MODIF' +
042200000726     A                                      )
042300000726     A            CMMM       00002A  B
042400000727     A
042500000726     A                                      TEXT('MOIS MODIF')
042600000726     A                                      COLHDG( +
042700000726     A                                      'MOIS' +
042800000726     A                                      'MODIF' +
042900000726     A                                      )
043000000726     A            CJJM       00002A  B
043100000727     A
043200000726     A                                      TEXT('JOUR MODIF')
043300000726     A                                      COLHDG( +
043400000726     A                                      'JOUR' +
043500000726     A                                      'MODIF' +
043600000726     A                                      )
043700000726     A            CHHM       00002A  B
043800000727     A
043900000726     A                                      TEXT('HEURE MODIF')
044000000726     A                                      COLHDG( +
044100000726     A                                      'HEURE' +
044200000726     A                                      'MODIF' +
044300000726     A                                      )
044400000726     A            CMNM       00002A  B
044500000727     A
044600000726     A                                      TEXT('MINUTE MODIF')
044700000726     A                                      COLHDG( +
044800000726     A                                      'MINUTE' +
044900000726     A                                      'MODIF' +
045000000726     A                                      )
045100000726     A            CSSM       00002A  B
045200000727     A
045300000726     A                                      TEXT('SECONDE MODIF')
045400000726     A                                      COLHDG( +
045500000726     A                                      'SECONDE' +
045600000726     A                                      'MODIF' +
045700000726     A                                      )
045800000726     A            CAAS       00002A  B
045900000727     A
046000000726     A                                      TEXT('ANNEE SUPPRESS')
046100000726     A                                      COLHDG( +
046200000726     A                                      'AAS' +
046300000726     A                                      )
046400000726     A            CMMS       00002A  B
046500000727     A
046600000726     A                                      TEXT('MOIS SUPPRESS')
046700000726     A                                      COLHDG( +
046800000726     A                                      'MMS' +
046900000726     A                                      )
047000000726     A            CJJS       00002A  B
047100000727     A
047200000726     A                                      TEXT('JOUR SUPPRESS')
047300000726     A                                      COLHDG( +
047400000726     A                                      'JJS' +
047500000726     A                                      )
047600000726     A            CAAOUV     00002A  B
047700000727     A
047800000726     A                                      TEXT('AA OUVERT')
047900000726     A                                      COLHDG( +
048000000726     A                                      'AA' +
048100000726     A                                      'OUVERT' +
048200000726     A                                      )
048300000726     A            CMMOUV     00002A  B
048400000727     A
048500000726     A                                      TEXT('MM OUVERT')
048600000726     A                                      COLHDG( +
048700000726     A                                      'MM' +
048800000726     A                                      'OUVERT' +
048900000726     A                                      )
049000000726     A            CJJOUV     00002A  B
049100000727     A
049200000726     A                                      TEXT('JJ OUVERT')
049300000726     A                                      COLHDG( +
049400000726     A                                      'JJ' +
049500000726     A                                      'OUVERT' +
049600000726     A                                      )
049700000726     A            CAAFER     00002A  B
049800000727     A
049900000726     A                                      TEXT('AA FERMET')
050000000726     A                                      COLHDG( +
050100000726     A                                      'AA' +
050200000726     A                                      'FERMET' +
050300000726     A                                      )
050400000726     A            CMMFER     00002A  B
050500000727     A
050600000726     A                                      TEXT('MM FERMET')
050700000726     A                                      COLHDG( +
050800000726     A                                      'MM' +
050900000726     A                                      'FERMET' +
051000000726     A                                      )
051100000726     A            CJJFER     00002A  B
051200000727     A
051300000726     A                                      TEXT('JJ FERMET')
051400000726     A                                      COLHDG( +
051500000726     A                                      'JJ' +
051600000726     A                                      'FERMET' +
051700000726     A                                      )
051800000726     A            CCATST     00002A  B
051900000727     A
052000000726     A                                      TEXT('Catég statisti (INF: XXCAT')
052100000726     A                                      COLHDG( +
052200000726     A                                      'CAT' +
052300000726     A                                      'STAT' +
052400000726     A                                      )
052500000726     A            CSTAT      00005A  B
052600000727     A
052700000726     A                                      TEXT('Regroup stat: CATxx ou n°m')
052800000726     A                                      COLHDG( +
052900000726     A                                      'REGROUP' +
053000000726     A                                      'STATISTIQ' +
053100000726     A                                      )
053200000726     A            CRAIS      00030A  B
053300000727     A
053400000726     A                                      TEXT('RAISON SOCIALE')
053500000726     A                                      COLHDG( +
053600000726     A                                      'RAIS' +
053700000726     A                                      )
053800000726     A            CCRAI      00030A  B
053900000727     A
054000000726     A                                      TEXT('COMPLEMENT RAISON SOCIALE')
054100000726     A                                      COLHDG( +
054200000726     A                                      'CRAI' +
054300000726     A                                      )
054400000726     A            CRUE       00030A  B
054500000727     A
054600000726     A                                      TEXT('RUE OU LIEU-DIT')
054700000726     A                                      COLHDG( +
054800000726     A                                      'RUE' +
054900000726     A                                      )
055000000726     A            CZI        00030A  B
055100000727     A
055200000726     A                                      TEXT('ZONE INDUSTRIELLE')
055300000726     A                                      COLHDG( +
055400000726     A                                      'ZI' +
055500000726     A                                      )
055600000726     A            CBPOS      00030A  B
055700000727     A
055800000726     A                                      TEXT('BOITE POSTALE COMMUNE')
055900000726     A                                      COLHDG( +
056000000726     A                                      'BPOS' +
056100000726     A                                      )
056200000726     A            CCPOS      00005A  B
056300000727     A
056400000726     A                                      TEXT('CODE POSTAL')
056500000726     A                                      COLHDG( +
056600000726     A                                      'CPOS' +
056700000726     A                                      )
056800000726     A            CBDIS      00030A  B
056900000727     A
057000000726     A                                      TEXT('BUREAU DISTRIBUTEUR')
057100000726     A                                      COLHDG( +
057200000726     A                                      'BDIS' +
057300000726     A                                      )
057400000726     A            CTYFL      00001A  B
057500000727     A
057600000726     A                                      TEXT('1=PREFAC 2=POSTFAC')
057700000726     A                                      COLHDG( +
057800000726     A                                      'MODE' +
057900000726     A                                      'FACT' +
058000000726     A                                      )
058100000726     A          K CCID
