000100000726     A          R BPRAAO
000200000726     A            AACNFE     00006A  B
000300000727     A
000400000727     A                                      TEXT('GENCOD: CNUF MANUFACT')
000500000726     A                                      COLHDG( +
000600000726     A                                      'CNUF' +
000700000726     A                                      )
000800000726     A            AACIFE     00003A  B
000900000727     A
001000000727     A                                      TEXT('INTERNAL SUPPL CODE')
001100000726     A                                      COLHDG( +
001200000726     A                                      'CIF' +
001300000726     A                                      )
001400000726     A            AANCMD     00008A  B
001500000727     A
001600000727     A                                      TEXT('COMMAND NUMBER')
001700000726     A                                      COLHDG( +
001800000726     A                                      'NCMD' +
001900000726     A                                      )
002000000726     A            AANORD     00005A  B
002100000727     A
002200000727     A                                      TEXT('ORDER NUMBER')
002300000726     A                                      COLHDG( +
002400000726     A                                      'DRNORD' +
002500000726     A                                      )
002600000726     A            AACNDD     00003A  B
002700000727     A
002800000726     A                                      TEXT('CNUD   (INF:XXCNUD  )')
002900000726     A                                      COLHDG( +
003000000726     A                                      'CNUD' +
003100000726     A                                      )
003200000726     A            AACIDD     00005A  B
003300000727     A
003400000727     A                                      TEXT('ACTIVITY CENTER')
003500000726     A                                      COLHDG( +
003600000726     A                                      'CID' +
003700000726     A                                      )
003800000726     A            AACNDL     00003A  B
003900000727     A
004000000726     A                                      TEXT('CNUD   (INF:XXCNUD  )')
004100000726     A                                      COLHDG( +
004200000726     A                                      'CNUD' +
004300000726     A                                      )
004400000726     A            AACIDL     00005A  B
004500000727     A
004600000727     A                                      TEXT('ACTIVITY CENTER')
004700000726     A                                      COLHDG( +
004800000726     A                                      'CID' +
004900000726     A                                      )
005000000726     A            AAAAE      00002A  B
005100000727     A
005200000727     A                                      TEXT('INVOICING YR.')
005300000726     A                                      COLHDG( +
005400000726     A                                      'ANNEE' +
005500000726     A                                      'FACT.' +
005600000726     A                                      )
005700000726     A            AAMME      00002A  B
005800000727     A
005900000727     A                                      TEXT('INVOICING MONTH.')
006000000726     A                                      COLHDG( +
006100000726     A                                      'MOIS' +
006200000726     A                                      'FACT.' +
006300000726     A                                      )
006400000726     A            AAJJE      00002A  B
006500000727     A
006600000727     A                                      TEXT('INVOICING DAY.')
006700000726     A                                      COLHDG( +
006800000726     A                                      'JOUR' +
006900000726     A                                      'FACT.' +
007000000726     A                                      )
007100000726     A            AAAAL      00002A  B
007200000727     A
007300000727     A                                      TEXT('INVOICING YR.')
007400000726     A                                      COLHDG( +
007500000726     A                                      'ANNEE' +
007600000726     A                                      'FACT.' +
007700000726     A                                      )
007800000726     A            AAMML      00002A  B
007900000727     A
008000000727     A                                      TEXT('INVOICING MONTH.')
008100000726     A                                      COLHDG( +
008200000726     A                                      'MOIS' +
008300000726     A                                      'FACT.' +
008400000726     A                                      )
008500000726     A            AAJJL      00002A  B
008600000727     A
008700000727     A                                      TEXT('INVOICING DAY.')
008800000726     A                                      COLHDG( +
008900000726     A                                      'JOUR' +
009000000726     A                                      'FACT.' +
009100000726     A                                      )
009200000726     A            AAHHL      00002A  B
009300000727     A
009400000727     A                                      TEXT('HOUR CHANGE')
009500000726     A                                      COLHDG( +
009600000726     A                                      'HEURE' +
009700000726     A                                      'MODIF' +
009800000726     A                                      )
009900000726     A            AAMNL      00002A  B
010000000727     A
010100000727     A                                      TEXT('MINUTE CHANGE')
010200000726     A                                      COLHDG( +
010300000726     A                                      'MINUTE' +
010400000726     A                                      'MODIF' +
010500000726     A                                      )
010600000726     A            AASPCB     00004S00B
010700000727     A                                      TEXT('SUB-CONDITIONS SUPPL')
010800000726     A                                      COLHDG( +
010900000726     A                                      'SPCB' +
011000000726     A                                      )
011100000726     A            AAPCB      00004S00B
011200000727     A                                      TEXT('GENCOD: CONDITIONS SUPPL')
011300000726     A                                      COLHDG( +
011400000726     A                                      'PCB' +
011500000726     A                                      )
011600000726     A            AAEAN      00012A  B
011700000727     A
011800000726     A                                      TEXT('E.A.N.')
011900000726     A                                      COLHDG( +
012000000726     A                                      'EAN' +
012100000726     A                                      )
012200000726     A            AAKEAN     00001A  B
012300000727     A
012400000727     A                                      TEXT('EAN KEY')
012500000726     A                                      COLHDG( +
012600000726     A                                      'KEAN' +
012700000726     A                                      )
012800000726     A            AAVL       00002A  B
012900000727     A
013000000727     A                                      TEXT('VARIANT LOGISTICS')
013100000726     A                                      COLHDG( +
013200000726     A                                      'VL' +
013300000726     A                                      )
013400000726     A            AAVA       00002A  B
013500000727     A
013600000727     A                                      TEXT('GENCOD: VARIANT PROMO')
013700000726     A                                      COLHDG( +
013800000726     A                                      'VA' +
013900000726     A                                      )
014000000726     A            AAQT       00009P03B
014100000727     A                                      TEXT('QUANTITY')
014200000726     A                                      COLHDG( +
014300000726     A                                      'QTE' +
014400000726     A                                      )
014500000726     A            AAPA       00008P03B
014600000727     A                                      TEXT('BUYING PRICE')
014700000726     A                                      COLHDG( +
014800000726     A                                      'PRIX' +
014900000726     A                                      'ACHAT' +
015000000726     A                                      )
015100000726     A            AAPVM      00008P03B
015200000727     A                                      TEXT('SELLING PRICE MK')
015300000726     A                                      COLHDG( +
015400000726     A                                      'PRIX' +
015500000726     A                                      'VTE' +
015600000726     A                                      'MRQ' +
015700000726     A                                      )
015800000726     A            AARAC      00006A  B
015900000727     A
016000000727     A                                      TEXT('ART COMMAND: ROOT')
016100000726     A                                      COLHDG( +
016200000726     A                                      'RACINE' +
016300000726     A                                      )
016400000726     A            AACCC      00001A  B
016500000727     A
016600000727     A                                      TEXT('ART COMMANDE: CONDT CMD M')
016700000726     A                                      COLHDG( +
016800000726     A                                      'COND' +
016900000726     A                                      'CMDE' +
017000000726     A                                      'MAG' +
017100000726     A                                      )
017200000726     A            AAVPV      00002A  B
017300000727     A
017400000727     A                                      TEXT('ART COMMAND: LOT PROMO')
017500000726     A                                      COLHDG( +
017600000726     A                                      'LOT' +
017700000726     A                                      'PROMO' +
017800000726     A                                      )
017900000726     A            AAMOD      00001A  B
018000000727     A
018100000727     A                                      TEXT('MODULE')
018200000726     A                                      COLHDG( +
018300000726     A                                      'MOD' +
018400000726     A                                      )
018500000726     A            AADES      00030A  B
018600000727     A
018700000726     A                                      TEXT('DESIGNATION')
018800000726     A                                      COLHDG( +
018900000726     A                                      'DES' +
019000000726     A                                      )
019100000726     A            AAEMPL     00006A  B
019200000727     A
019300000727     A                                      TEXT('SITE CODE')
019400000726     A                                      COLHDG( +
019500000726     A                                      'EMPL' +
019600000726     A                                      )
019700000726     A            AAAAC      00002A  B
019800000727     A
019900000727     A                                      TEXT('CREATION YEAR')
020000000726     A                                      COLHDG( +
020100000726     A                                      'AAC' +
020200000726     A                                      )
020300000726     A            AAMMC      00002A  B
020400000727     A
020500000727     A                                      TEXT('CREATION MONTH')
020600000726     A                                      COLHDG( +
020700000726     A                                      'MMC' +
020800000726     A                                      )
020900000726     A            AAJJC      00002A  B
021000000727     A
021100000727     A                                      TEXT('CREATION DAY')
021200000726     A                                      COLHDG( +
021300000726     A                                      'JJC' +
021400000726     A                                      )
021500000726     A            AAHHC      00002A  B
021600000727     A
021700000727     A                                      TEXT('HOUR CHANGE')
021800000726     A                                      COLHDG( +
021900000726     A                                      'HEURE' +
022000000726     A                                      'MODIF' +
022100000726     A                                      )
022200000726     A            AAMNC      00002A  B
022300000727     A
022400000727     A                                      TEXT('MINUTE CHANGE')
022500000726     A                                      COLHDG( +
022600000726     A                                      'MINUTE' +
022700000726     A                                      'MODIF' +
022800000726     A                                      )
022900000726     A            AASSC      00002A  B
023000000727     A
023100000727     A                                      TEXT('SECONDE CHANGE')
023200000726     A                                      COLHDG( +
023300000726     A                                      'SECONDE' +
023400000726     A                                      'MODIF' +
023500000726     A                                      )
023600000726     A            AAANO      00002A  B
023700000727     A
023800000727     A                                      TEXT('ANOMALY TYPE')
023900000726     A                                      COLHDG( +
024000000726     A                                      'TYPE' +
024100000726     A                                      'ANO' +
024200000726     A                                      )
024300000726     A            AALANO     00050A  B
024400000727     A
024500000727     A                                      TEXT('ANOMALY LABEL')
024600000726     A                                      COLHDG( +
024700000726     A                                      'LIBELLE ANOMALIE' +
024800000726     A                                      )
