000100000726     A          R BPRDR
000200000726     A                                      TEXT('Fichier Détail Réception')
000300000726     A            DRTYRC     00002A  B
000400000726     A                                      CCSID(00297)
000500000726     A                                      TEXT('TYPE RECEP')
000600000726     A                                      COLHDG( +
000700000726     A                                      'TYPE' +
000800000726     A                                      'RECEP' +
000900000726     A                                      )
001000000726     A            DRCIDR     00005A  B
001100000726     A                                      CCSID(00297)
001200000726     A                                      TEXT('CID RATTACHEMENT')
001300000726     A                                      COLHDG( +
001400000726     A                                      'CID' +
001500000726     A                                      'RATTACHEMENT' +
001600000726     A                                      )
001700000726     A            DRKAPP     00003A  B
001800000726     A                                      CCSID(00297)
001900000726     A                                      TEXT('APPRO')
002000000726     A                                      COLHDG( +
002100000726     A                                      'APPRO' +
002200000726     A                                      )
002300000726     A            DRKDEP     00002A  B
002400000726     A                                      CCSID(00297)
002500000726     A                                      TEXT('DEP')
002600000726     A                                      COLHDG( +
002700000726     A                                      'DEP' +
002800000726     A                                      )
002900000726     A            DRKRAY     00002A  B
003000000726     A                                      CCSID(00297)
003100000726     A                                      TEXT('RAY')
003200000726     A                                      COLHDG( +
003300000726     A                                      'RAY' +
003400000726     A                                      )
003500000726     A            DRKSEC     00002A  B
003600000726     A                                      CCSID(00297)
003700000726     A                                      TEXT('SECT')
003800000726     A                                      COLHDG( +
003900000726     A                                      'SECT' +
004000000726     A                                      )
004100000726     A            DRCNUL     00006A  B
004200000726     A                                      CCSID(00297)
004300000726     A                                      TEXT('CNUL')
004400000726     A                                      COLHDG( +
004500000726     A                                      'CNUL' +
004600000726     A                                      )
004700000726     A            DRNENT     00002A  B
004800000726     A                                      CCSID(00297)
004900000726     A                                      TEXT('NO ENT SEC')
005000000726     A                                      COLHDG( +
005100000726     A                                      'NO' +
005200000726     A                                      'ENT' +
005300000726     A                                      'SEC' +
005400000726     A                                      )
005500000726     A            DRCID      00005A  B
005600000726     A                                      CCSID(00297)
005700000726     A                                      TEXT('CID')
005800000726     A                                      COLHDG( +
005900000726     A                                      'CID' +
006000000726     A                                      )
006100000726     A            DRAARC     00002A  B
006200000726     A                                      CCSID(00297)
006300000726     A                                      TEXT('ANNEE RECEPTION')
006400000726     A                                      COLHDG( +
006500000726     A                                      'ANNEE' +
006600000726     A                                      'RECEPTION' +
006700000726     A                                      )
006800000726     A            DRMMRC     00002A  B
006900000726     A                                      CCSID(00297)
007000000726     A                                      TEXT('MOIS RECEPTION')
007100000726     A                                      COLHDG( +
007200000726     A                                      'MOIS' +
007300000726     A                                      'RECEPTION' +
007400000726     A                                      )
007500000726     A            DRJJRC     00002A  B
007600000726     A                                      CCSID(00297)
007700000726     A                                      TEXT('JOUR RECEPTION')
007800000726     A                                      COLHDG( +
007900000726     A                                      'JOUR' +
008000000726     A                                      'RECEPTION' +
008100000726     A                                      )
008200000726     A            DRNORD     00005A  B
008300000726     A                                      CCSID(00297)
008400000726     A                                      TEXT('NUMERO ORDRE')
008500000726     A                                      COLHDG( +
008600000726     A                                      'NUMERO' +
008700000726     A                                      'ORDRE' +
008800000726     A                                      )
008900000726     A            DRSLIM     00007A  B
009000000726     A                                      CCSID(00297)
009100000726     A                                      TEXT('COD ART')
009200000726     A                                      COLHDG( +
009300000726     A                                      'COD ART' +
009400000726     A                                      )
009500000726     A            DRMOD      00001A  B
009600000726     A                                      CCSID(00297)
009700000726     A                                      TEXT('MOD')
009800000726     A                                      COLHDG( +
009900000726     A                                      'MOD' +
010000000726     A                                      )
010100000726     A            DRQTE      00009P03B
010200000726     A                                      TEXT('QUANTITE')
010300000726     A                                      COLHDG( +
010400000726     A                                      'QUANTITE' +
010500000726     A                                      )
010600000726     A            DRPA       00009P03B
010700000726     A                                      TEXT('PRIX ACHAT')
010800000726     A                                      COLHDG( +
010900000726     A                                      'PRIX' +
011000000726     A                                      'ACHAT' +
011100000726     A                                      )
011200000726     A            DRPV       00009P02B
011300000726     A                                      TEXT('PRIX VENTE')
011400000726     A                                      COLHDG( +
011500000726     A                                      'PRIX' +
011600000726     A                                      'VENTE' +
011700000726     A                                      )
011800000726     A            DRTAX      00009P03B
011900000726     A                                      TEXT('TAXE')
012000000726     A                                      COLHDG( +
012100000726     A                                      'TAXE' +
012200000726     A                                      )
012300000726     A            DRTVA      00002A  B
012400000726     A                                      CCSID(00297)
012500000726     A                                      TEXT('CODE TVA')
012600000726     A                                      COLHDG( +
012700000726     A                                      'CODE' +
012800000726     A                                      'TVA' +
012900000726     A                                      )
013000000726     A            DRRET      00002A  B
013100000726     A                                      CCSID(00297)
013200000726     A                                      TEXT('RETOUR')
013300000726     A                                      COLHDG( +
013400000726     A                                      'RETOUR' +
013500000726     A                                      )
013600000726     A            DRRGVI     00007P03B
013700000726     A                                      TEXT('VIGNETTE')
013800000726     A                                      COLHDG( +
013900000726     A                                      'VIGNETTE' +
014000000726     A                                      )
014100000726     A            DRRGDR     00007P03B
014200000726     A                                      TEXT('DROITS REGIE')
014300000726     A                                      COLHDG( +
014400000726     A                                      'DROITS' +
014500000726     A                                      'REGIE' +
014600000726     A                                      )
014700000726     A            DRCNUF     00006A  B
014800000726     A                                      CCSID(00297)
014900000726     A                                      TEXT('CNUF')
015000000726     A                                      COLHDG( +
015100000726     A                                      'CNUF' +
015200000726     A                                      )
015300000726     A            DRCIP      00006A  B
015400000726     A                                      CCSID(00297)
015500000726     A                                      TEXT('CIP')
015600000726     A                                      COLHDG( +
015700000726     A                                      'CIP' +
015800000726     A                                      )
015900000726     A            DRVA       00002A  B
016000000726     A                                      CCSID(00297)
016100000726     A                                      TEXT('VA')
016200000726     A                                      COLHDG( +
016300000726     A                                      'VA' +
016400000726     A                                      )
016500000726     A            DRPCB      00004S00B
016600000726     A                                      TEXT('PCB')
016700000726     A                                      COLHDG( +
016800000726     A                                      'PCB' +
016900000726     A                                      )
017000000726     A            DRFAM      00003A  B
017100000726     A                                      CCSID(00297)
017200000726     A                                      TEXT('FAM')
017300000726     A                                      COLHDG( +
017400000726     A                                      'FAM' +
017500000726     A                                      )
017600000726     A            DRSFA      00003A  B
017700000726     A                                      CCSID(00297)
017800000726     A                                      TEXT('SFAM')
017900000726     A                                      COLHDG( +
018000000726     A                                      'SFAM' +
018100000726     A                                      )
018200000726     A            DRCAT      00002A  B
018300000726     A                                      CCSID(00297)
018400000726     A                                      TEXT('CAT')
018500000726     A                                      COLHDG( +
018600000726     A                                      'CAT' +
018700000726     A                                      )
018800000726     A            DRGST      00002A  B
018900000726     A                                      CCSID(00297)
019000000726     A                                      TEXT('GESTION STOCK')
019100000726     A                                      COLHDG( +
019200000726     A                                      'GESTION' +
019300000726     A                                      'STOCK' +
019400000726     A                                      )
019500000726     A            DRTART     00002A  B
019600000726     A                                      CCSID(00297)
019700000726     A                                      TEXT('TYPE ARTICLE')
019800000726     A                                      COLHDG( +
019900000726     A                                      'TYPE' +
020000000726     A                                      'ARTICLE' +
020100000726     A                                      )
020200000726     A            DRLCON     00002A  B
020300000726     A                                      CCSID(00297)
020400000726     A                                      TEXT('LISTE CONCURENCE')
020500000726     A                                      COLHDG( +
020600000726     A                                      'LISTE' +
020700000726     A                                      'CONCURENCE' +
020800000726     A                                      )
020900000726     A            DRRIST     00007P02B
021000000726     A                                      TEXT('RIST')
021100000726     A                                      COLHDG( +
021200000726     A                                      'RIST' +
021300000726     A                                      )
021400000726     A            DRCRIS     00001A  B
021500000726     A                                      CCSID(00297)
021600000726     A                                      TEXT('COD RIST')
021700000726     A                                      COLHDG( +
021800000726     A                                      'COD' +
021900000726     A                                      'RIST' +
022000000726     A                                      )
022100000726     A            DRCOOP     00007P02B
022200000726     A                                      TEXT('COOP')
022300000726     A                                      COLHDG( +
022400000726     A                                      'COOP' +
022500000726     A                                      )
022600000726     A            DRCCOO     00001A  B
022700000726     A                                      CCSID(00297)
022800000726     A                                      TEXT('COD COOP')
022900000726     A                                      COLHDG( +
023000000726     A                                      'COD' +
023100000726     A                                      'COOP' +
023200000726     A                                      )
023300000726     A            DRNEG      00007P02B
023400000726     A                                      TEXT('REM NEG MAG')
023500000726     A                                      COLHDG( +
023600000726     A                                      'REM' +
023700000726     A                                      'NEG' +
023800000726     A                                      'MAG' +
023900000726     A                                      )
024000000726     A            DRCNEG     00001A  B
024100000726     A                                      CCSID(00297)
024200000726     A                                      TEXT('COD NEG MAG')
024300000726     A                                      COLHDG( +
024400000726     A                                      'COD' +
024500000726     A                                      'NEG' +
024600000726     A                                      'MAG' +
024700000726     A                                      )
024800000726     A            DRRF       00007P03B
024900000726     A                                      TEXT('REM FCT')
025000000726     A                                      COLHDG( +
025100000726     A                                      'REM' +
025200000726     A                                      'FCT' +
025300000726     A                                      )
025400000726     A            DRCRF      00001A  B
025500000726     A                                      CCSID(00297)
025600000726     A                                      TEXT('COD REM FCT')
025700000726     A                                      COLHDG( +
025800000726     A                                      'COD' +
025900000726     A                                      'REM' +
026000000726     A                                      'FCT' +
026100000726     A                                      )
026200000726     A            DRAVDF     00002A  B
026300000726     A                                      CCSID(00297)
026400000726     A                                      TEXT('TAUX AVD FIXE')
026500000726     A                                      COLHDG( +
026600000726     A                                      'TAUX' +
026700000726     A                                      'AVD' +
026800000726     A                                      'FIXE' +
026900000726     A                                      )
027000000726     A            DRTAX1     00009P03B
027100000726     A                                      TEXT('TAXE')
027200000726     A                                      COLHDG( +
027300000726     A                                      'TAXE' +
027400000726     A                                      )
027500000726     A            DRTAX2     00009P03B
027600000726     A                                      TEXT('TAXE')
027700000726     A                                      COLHDG( +
027800000726     A                                      'TAXE' +
027900000726     A                                      )
028000000726     A            DRTRSP     00007P02B
028100000726     A                                      TEXT('TRANSPORT')
028200000726     A                                      COLHDG( +
028300000726     A                                      'TRANSPORT' +
028400000726     A                                      )
028500000726     A            DRTOP1     00002A  B
028600000726     A                                      CCSID(00297)
028700000726     A                                      TEXT('TOP')
028800000726     A                                      COLHDG( +
028900000726     A                                      'TOP' +
029000000726     A                                      )
029100000726     A            DRTOP2     00002A  B
029200000726     A                                      CCSID(00297)
029300000726     A                                      TEXT('TOP')
029400000726     A                                      COLHDG( +
029500000726     A                                      'TOP' +
029600000726     A                                      )
029700000726     A            DRTOP3     00002A  B
029800000726     A                                      CCSID(00297)
029900000726     A                                      TEXT('TOP')
030000000726     A                                      COLHDG( +
030100000726     A                                      'TOP' +
030200000726     A                                      )
030300000726     A            DRTOP4     00002A  B
030400000726     A                                      CCSID(00297)
030500000726     A                                      TEXT('TOP')
030600000726     A                                      COLHDG( +
030700000726     A                                      'TOP' +
030800000726     A                                      )
030900000726     A            DRTOP5     00002A  B
031000000726     A                                      CCSID(00297)
031100000726     A                                      TEXT('TOP')
031200000726     A                                      COLHDG( +
031300000726     A                                      'TOP' +
031400000726     A                                      )
031500000726     A            DRAAFT     00002A  B
031600000726     A                                      CCSID(00297)
031700000726     A                                      TEXT('ANNEE')
031800000726     A                                      COLHDG( +
031900000726     A                                      'ANNEE' +
032000000726     A                                      )
032100000726     A            DRMMFT     00002A  B
032200000726     A                                      CCSID(00297)
032300000726     A                                      TEXT('MOIS')
032400000726     A                                      COLHDG( +
032500000726     A                                      'MOIS' +
032600000726     A                                      )
032700000726     A            DRJJFT     00002A  B
032800000726     A                                      CCSID(00297)
032900000726     A                                      TEXT('JOUR')
033000000726     A                                      COLHDG( +
033100000726     A                                      'JOUR' +
033200000726     A                                      )
033300000726     A            DRNORF     00005A  B
033400000726     A                                      CCSID(00297)
033500000726     A                                      TEXT('NUMERO ORDRE FACT')
033600000726     A                                      COLHDG( +
033700000726     A                                      'NUMERO' +
033800000726     A                                      'ORDRE' +
033900000726     A                                      'FACT' +
034000000726     A                                      )
034100000726     A          K DRTYRC
034200000726     A          K DRCIDR
034300000726     A          K DRKAPP
034400000726     A          K DRKDEP
034500000726     A          K DRKRAY
034600000726     A          K DRKSEC
034700000726     A          K DRCNUL
034800000726     A          K DRNENT
034900000726     A          K DRCID
035000000726     A          K DRAARC
035100000726     A          K DRMMRC
035200000726     A          K DRJJRC
035300000726     A          K DRNORD
035400000726     A          K DRSLIM
