000100000726     A                                      UNIQUE
000200000726     A          R ZPRFR
000300000726     A                                      TEXT('aaaa')
000400000726     A            FRECRA     00010A  B
000500000726     A                                      CCSID(00297)
000600000726     A                                      TEXT('VEROUILLAGE ECRAN')
000700000726     A                                      COLHDG( +
000800000726     A                                      'NOM ECRAN' +
000900000726     A                                      )
001000000726     A            FRSTTS     00001A  B
001100000726     A                                      CCSID(00297)
001200000726     A                                      TEXT('STATUS ENREG 0 = INACTIF')
001300000726     A                                      COLHDG( +
001400000726     A                                      'ST' +
001500000726     A                                      )
001600000726     A            FRCNUF     00006A  B
001700000726     A                                      CCSID(00297)
001800000726     A                                      TEXT('CNUF')
001900000726     A                                      COLHDG( +
002000000726     A                                      'CNUF' +
002100000726     A                                      )
002200000726     A            FRCNUA     00006A  B
002300000726     A                                      CCSID(00297)
002400000726     A                                      TEXT('ANCIEN CNUF')
002500000726     A                                      COLHDG( +
002600000726     A                                      'ANCIEN' +
002700000726     A                                      'CNUF' +
002800000726     A                                      )
002900000726     A            FRCNUN     00006A  B
003000000726     A                                      CCSID(00297)
003100000726     A                                      TEXT('NOUVEAU CNUF')
003200000726     A                                      COLHDG( +
003300000726     A                                      'NOUVEAU' +
003400000726     A                                      'CNUF' +
003500000726     A                                      )
003600000726     A            FRAAAP     00002A  B
003700000726     A                                      CCSID(00297)
003800000726     A                                      TEXT('ANNEE APPLICAT')
003900000726     A                                      COLHDG( +
004000000726     A                                      'ANNEE' +
004100000726     A                                      'APPLICAT' +
004200000726     A                                      )
004300000726     A            FRMMAP     00002A  B
004400000726     A                                      CCSID(00297)
004500000726     A                                      TEXT('MOIS APPLICAT')
004600000726     A                                      COLHDG( +
004700000726     A                                      'MOIS' +
004800000726     A                                      'APPLICAT' +
004900000726     A                                      )
005000000726     A            FRJJAP     00002A  B
005100000726     A                                      CCSID(00297)
005200000726     A                                      TEXT('JOUR APPLICAT')
005300000726     A                                      COLHDG( +
005400000726     A                                      'JOUR' +
005500000726     A                                      'APPLICAT' +
005600000726     A                                      )
005700000726     A            FRCDIN     00006A  B
005800000726     A                                      CCSID(00297)
005900000726     A                                      TEXT('CODE FOURNISSEUR INTERNE')
006000000726     A                                      COLHDG( +
006100000726     A                                      'CODE' +
006200000726     A                                      'INTERNE' +
006300000726     A                                      )
006400000726     A            FRNSF      00012A  B
006500000726     A                                      CCSID(00297)
006600000726     A                                      TEXT('NOM SIMPLIFIE')
006700000726     A                                      COLHDG( +
006800000726     A                                      'NOM SIMPLIF.' +
006900000726     A                                      )
007000000726     A            FRINEX     00001A  B
007100000726     A                                      CCSID(00297)
007200000726     A                                      TEXT('INTERNE EXTERNE')
007300000726     A                                      COLHDG( +
007400000726     A                                      'INTERNE' +
007500000726     A                                      'EXTERNE' +
007600000726     A                                      )
007700000726     A            FRLVFB     00002A  B
007800000726     A                                      CCSID(00297)
007900000726     A                                      TEXT('TYPE DE CNUF   (INF: XXCNU')
008000000726     A                                      COLHDG( +
008100000726     A                                      'TYPE' +
008200000726     A                                      'CNUF' +
008300000726     A                                      )
008400000726     A            FRNALO     00002A  B
008500000726     A                                      CCSID(00297)
008600000726     A                                      TEXT('NAT LOC')
008700000726     A                                      COLHDG( +
008800000726     A                                      'NAT' +
008900000726     A                                      'LOC' +
009000000726     A                                      )
009100000726     A            FRRIST     00005P03B
009200000726     A                                      TEXT('RIST')
009300000726     A                                      COLHDG( +
009400000726     A                                      'RIST' +
009500000726     A                                      )
009600000726     A            FRCOOP     00005P03B
009700000726     A                                      TEXT('COOP')
009800000726     A                                      COLHDG( +
009900000726     A                                      'COOP' +
010000000726     A                                      )
010100000726     A            FRCODR     00001A  B
010200000726     A                                      CCSID(00297)
010300000726     A                                      TEXT('TYPE R.F.: 0=NON 1=ART 2=F')
010400000726     A                                      COLHDG( +
010500000726     A                                      'TYPE' +
010600000726     A                                      'RF' +
010700000726     A                                      )
010800000726     A            FRFONC     00005P03B
010900000726     A                                      TEXT('REMISE FONC')
011000000726     A                                      COLHDG( +
011100000726     A                                      'REMISE' +
011200000726     A                                      'FONC' +
011300000726     A                                      )
011400000726     A            FRRAY1     00001A  B
011500000726     A                                      CCSID(00297)
011600000726     A                                      TEXT('RAY 1: 0=NON 1=OUI')
011700000726     A                                      COLHDG( +
011800000726     A                                      'RAY 1' +
011900000726     A                                      )
012000000726     A            FRRAY2     00001A  B
012100000726     A                                      CCSID(00297)
012200000726     A                                      TEXT('RAY 2: 0=NON 1=OUI')
012300000726     A                                      COLHDG( +
012400000726     A                                      'RAY 2' +
012500000726     A                                      )
012600000726     A            FRRAY3     00001A  B
012700000726     A                                      CCSID(00297)
012800000726     A                                      TEXT('RAY 3: 0=NON 1=OUI')
012900000726     A                                      COLHDG( +
013000000726     A                                      'RAY 3' +
013100000726     A                                      )
013200000726     A            FRRAY4     00001A  B
013300000726     A                                      CCSID(00297)
013400000726     A                                      TEXT('RAY 4: 0=NON 1=OUI')
013500000726     A                                      COLHDG( +
013600000726     A                                      'RAY 4' +
013700000726     A                                      )
013800000726     A            FRRAY5     00001A  B
013900000726     A                                      CCSID(00297)
014000000726     A                                      TEXT('RAY 5: 0=NON 1=OUI')
014100000726     A                                      COLHDG( +
014200000726     A                                      'RAY 5' +
014300000726     A                                      )
014400000726     A            FRRAY6     00001A  B
014500000726     A                                      CCSID(00297)
014600000726     A                                      TEXT('RAY 6: 0=NON 1=OUI')
014700000726     A                                      COLHDG( +
014800000726     A                                      'RAY 6' +
014900000726     A                                      )
015000000726     A            FRRAY7     00001A  B
015100000726     A                                      CCSID(00297)
015200000726     A                                      TEXT('RAY 7: 0=NON 1=OUI')
015300000726     A                                      COLHDG( +
015400000726     A                                      'RAY 7' +
015500000726     A                                      )
015600000726     A            FRRAY8     00001A  B
015700000726     A                                      CCSID(00297)
015800000726     A                                      TEXT('RAY 8: 0=NON 1=OUI')
015900000726     A                                      COLHDG( +
016000000726     A                                      'RAY 8' +
016100000726     A                                      )
016200000726     A            FRRAY9     00001A  B
016300000726     A                                      CCSID(00297)
016400000726     A                                      TEXT('RAY 9: 0=NON 1=OUI')
016500000726     A                                      COLHDG( +
016600000726     A                                      'RAY 9' +
016700000726     A                                      )
016800000726     A            FRAAC      00002A  B
016900000726     A                                      CCSID(00297)
017000000726     A                                      TEXT('ANNEE CREATION')
017100000726     A                                      COLHDG( +
017200000726     A                                      'ANNEE' +
017300000726     A                                      'CREATION' +
017400000726     A                                      )
017500000726     A            FRMMC      00002A  B
017600000726     A                                      CCSID(00297)
017700000726     A                                      TEXT('MOIS CREATION')
017800000726     A                                      COLHDG( +
017900000726     A                                      'MOIS' +
018000000726     A                                      'CREATION' +
018100000726     A                                      )
018200000726     A            FRJJC      00002A  B
018300000726     A                                      CCSID(00297)
018400000726     A                                      TEXT('JOUR CREATION')
018500000726     A                                      COLHDG( +
018600000726     A                                      'JOUR' +
018700000726     A                                      'CREATION' +
018800000726     A                                      )
018900000726     A            FRAAM      00002A  B
019000000726     A                                      CCSID(00297)
019100000726     A                                      TEXT('ANNEE MODIF')
019200000726     A                                      COLHDG( +
019300000726     A                                      'ANNEE' +
019400000726     A                                      'MODIF' +
019500000726     A                                      )
019600000726     A            FRMMM      00002A  B
019700000726     A                                      CCSID(00297)
019800000726     A                                      TEXT('MOIS MODIF')
019900000726     A                                      COLHDG( +
020000000726     A                                      'MOIS' +
020100000726     A                                      'MODIF' +
020200000726     A                                      )
020300000726     A            FRJJM      00002A  B
020400000726     A                                      CCSID(00297)
020500000726     A                                      TEXT('JOUR MODIF')
020600000726     A                                      COLHDG( +
020700000726     A                                      'JOUR' +
020800000726     A                                      'MODIF' +
020900000726     A                                      )
021000000726     A            FRHHM      00002A  B
021100000726     A                                      CCSID(00297)
021200000726     A                                      TEXT('HEURE MODIF')
021300000726     A                                      COLHDG( +
021400000726     A                                      'HEURE' +
021500000726     A                                      'MODIF' +
021600000726     A                                      )
021700000726     A            FRMNM      00002A  B
021800000726     A                                      CCSID(00297)
021900000726     A                                      TEXT('MINUTE MODIF')
022000000726     A                                      COLHDG( +
022100000726     A                                      'MINUTE' +
022200000726     A                                      'MODIF' +
022300000726     A                                      )
022400000726     A            FRSSM      00002A  B
022500000726     A                                      CCSID(00297)
022600000726     A                                      TEXT('SECONDE MODIF')
022700000726     A                                      COLHDG( +
022800000726     A                                      'SECONDE' +
022900000726     A                                      'MODIF' +
023000000726     A                                      )
023100000726     A            FRAAS      00002A  B
023200000726     A                                      CCSID(00297)
023300000726     A                                      TEXT('ANNEE SUPPRESS')
023400000726     A                                      COLHDG( +
023500000726     A                                      'ANNEE' +
023600000726     A                                      'SUPPRESS' +
023700000726     A                                      )
023800000726     A            FRMMS      00002A  B
023900000726     A                                      CCSID(00297)
024000000726     A                                      TEXT('MOIS SUPPRESS')
024100000726     A                                      COLHDG( +
024200000726     A                                      'MOIS' +
024300000726     A                                      'SUPPRESS' +
024400000726     A                                      )
024500000726     A            FRJJS      00002A  B
024600000726     A                                      CCSID(00297)
024700000726     A                                      TEXT('JOUR SUPPRESS')
024800000726     A                                      COLHDG( +
024900000726     A                                      'JOUR' +
025000000726     A                                      'SUPPRESS' +
025100000726     A                                      )
025200000726     A            FRCC1      00003A  B
025300000726     A                                      CCSID(00297)
025400000726     A                                      TEXT('CIF CDE 1')
025500000726     A                                      COLHDG( +
025600000726     A                                      'CIF' +
025700000726     A                                      'CDE 1' +
025800000726     A                                      )
025900000726     A            FRCR1      00003A  B
026000000726     A                                      CCSID(00297)
026100000726     A                                      TEXT('CIF REG 1')
026200000726     A                                      COLHDG( +
026300000726     A                                      'CIF' +
026400000726     A                                      'REG 1' +
026500000726     A                                      )
026600000726     A            FRCC2      00003A  B
026700000726     A                                      CCSID(00297)
026800000726     A                                      TEXT('CIF CDE 2')
026900000726     A                                      COLHDG( +
027000000726     A                                      'CIF' +
027100000726     A                                      'CDE 2' +
027200000726     A                                      )
027300000726     A            FRCR2      00003A  B
027400000726     A                                      CCSID(00297)
027500000726     A                                      TEXT('CIF REG 2')
027600000726     A                                      COLHDG( +
027700000726     A                                      'CIF' +
027800000726     A                                      'REG 2' +
027900000726     A                                      )
028000000726     A            FRCC3      00003A  B
028100000726     A                                      CCSID(00297)
028200000726     A                                      TEXT('CIF CDE 3')
028300000726     A                                      COLHDG( +
028400000726     A                                      'CIF' +
028500000726     A                                      'CDE 3' +
028600000726     A                                      )
028700000726     A            FRCR3      00003A  B
028800000726     A                                      CCSID(00297)
028900000726     A                                      TEXT('CIF REG 3')
029000000726     A                                      COLHDG( +
029100000726     A                                      'CIF' +
029200000726     A                                      'REG 3' +
029300000726     A                                      )
029400000726     A            FRCC4      00003A  B
029500000726     A                                      CCSID(00297)
029600000726     A                                      TEXT('CIF CDE 4')
029700000726     A                                      COLHDG( +
029800000726     A                                      'CIF' +
029900000726     A                                      'CDE 4' +
030000000726     A                                      )
030100000726     A            FRCR4      00003A  B
030200000726     A                                      CCSID(00297)
030300000726     A                                      TEXT('CIF REG 4')
030400000726     A                                      COLHDG( +
030500000726     A                                      'CIF' +
030600000726     A                                      'REG 4' +
030700000726     A                                      )
030800000726     A            FRCC5      00003A  B
030900000726     A                                      CCSID(00297)
031000000726     A                                      TEXT('CIF CDE 5')
031100000726     A                                      COLHDG( +
031200000726     A                                      'CIF' +
031300000726     A                                      'CDE 5' +
031400000726     A                                      )
031500000726     A            FRCR5      00003A  B
031600000726     A                                      CCSID(00297)
031700000726     A                                      TEXT('CIF REG 5')
031800000726     A                                      COLHDG( +
031900000726     A                                      'CIF' +
032000000726     A                                      'REG 5' +
032100000726     A                                      )
032200000726     A            FRCC6      00003A  B
032300000726     A                                      CCSID(00297)
032400000726     A                                      TEXT('CIF CDE 6')
032500000726     A                                      COLHDG( +
032600000726     A                                      'CIF' +
032700000726     A                                      'CDE 6' +
032800000726     A                                      )
032900000726     A            FRCR6      00003A  B
033000000726     A                                      CCSID(00297)
033100000726     A                                      TEXT('CIF REG 6')
033200000726     A                                      COLHDG( +
033300000726     A                                      'CIF' +
033400000726     A                                      'REG 6' +
033500000726     A                                      )
033600000726     A            FRCC7      00003A  B
033700000726     A                                      CCSID(00297)
033800000726     A                                      TEXT('CIF CDE 7')
033900000726     A                                      COLHDG( +
034000000726     A                                      'CIF' +
034100000726     A                                      'CDE 7' +
034200000726     A                                      )
034300000726     A            FRCR7      00003A  B
034400000726     A                                      CCSID(00297)
034500000726     A                                      TEXT('CIF REG 7')
034600000726     A                                      COLHDG( +
034700000726     A                                      'CIF' +
034800000726     A                                      'REG 7' +
034900000726     A                                      )
035000000726     A            FRCC8      00003A  B
035100000726     A                                      CCSID(00297)
035200000726     A                                      TEXT('CIF CDE 8')
035300000726     A                                      COLHDG( +
035400000726     A                                      'CIF' +
035500000726     A                                      'CDE 8' +
035600000726     A                                      )
035700000726     A            FRCR8      00003A  B
035800000726     A                                      CCSID(00297)
035900000726     A                                      TEXT('CIF REG 8')
036000000726     A                                      COLHDG( +
036100000726     A                                      'CIF' +
036200000726     A                                      'REG 8' +
036300000726     A                                      )
036400000726     A            FRCC9      00003A  B
036500000726     A                                      CCSID(00297)
036600000726     A                                      TEXT('CIF CDE 9')
036700000726     A                                      COLHDG( +
036800000726     A                                      'CIF' +
036900000726     A                                      'CDE 9' +
037000000726     A                                      )
037100000726     A            FRCR9      00003A  B
037200000726     A                                      CCSID(00297)
037300000726     A                                      TEXT('CIF REG 9')
037400000726     A                                      COLHDG( +
037500000726     A                                      'CIF' +
037600000726     A                                      'REG 9' +
037700000726     A                                      )
037800000726     A            FRCC10     00003A  B
037900000726     A                                      CCSID(00297)
038000000726     A                                      TEXT('CIF CDE 10')
038100000726     A                                      COLHDG( +
038200000726     A                                      'CIF' +
038300000726     A                                      'CDE 10' +
038400000726     A                                      )
038500000726     A            FRCR10     00003A  B
038600000726     A                                      CCSID(00297)
038700000726     A                                      TEXT('CIF REG 10')
038800000726     A                                      COLHDG( +
038900000726     A                                      'CIF' +
039000000726     A                                      'REG 10' +
039100000726     A                                      )
039200000726     A            FRCC11     00003A  B
039300000726     A                                      CCSID(00297)
039400000726     A                                      TEXT('CIF CDE 11')
039500000726     A                                      COLHDG( +
039600000726     A                                      'CIF' +
039700000726     A                                      'CDE 11' +
039800000726     A                                      )
039900000726     A            FRCR11     00003A  B
040000000726     A                                      CCSID(00297)
040100000726     A                                      TEXT('CIF REG 11')
040200000726     A                                      COLHDG( +
040300000726     A                                      'CIF' +
040400000726     A                                      'REG 11' +
040500000726     A                                      )
040600000726     A            FRCC12     00003A  B
040700000726     A                                      CCSID(00297)
040800000726     A                                      TEXT('CIF CDE 12')
040900000726     A                                      COLHDG( +
041000000726     A                                      'CIF' +
041100000726     A                                      'CDE 12' +
041200000726     A                                      )
041300000726     A            FRCR12     00003A  B
041400000726     A                                      CCSID(00297)
041500000726     A                                      TEXT('CIF REG 12')
041600000726     A                                      COLHDG( +
041700000726     A                                      'CIF' +
041800000726     A                                      'REG 12' +
041900000726     A                                      )
042000000726     A            FRCC13     00003A  B
042100000726     A                                      CCSID(00297)
042200000726     A                                      TEXT('CIF CDE 13')
042300000726     A                                      COLHDG( +
042400000726     A                                      'CIF' +
042500000726     A                                      'CDE 13' +
042600000726     A                                      )
042700000726     A            FRCR13     00003A  B
042800000726     A                                      CCSID(00297)
042900000726     A                                      TEXT('CIF REG 13')
043000000726     A                                      COLHDG( +
043100000726     A                                      'CIF' +
043200000726     A                                      'REG 13' +
043300000726     A                                      )
043400000726     A            FRCC14     00003A  B
043500000726     A                                      CCSID(00297)
043600000726     A                                      TEXT('CIF CDE 14')
043700000726     A                                      COLHDG( +
043800000726     A                                      'CIF' +
043900000726     A                                      'CDE 14' +
044000000726     A                                      )
044100000726     A            FRCR14     00003A  B
044200000726     A                                      CCSID(00297)
044300000726     A                                      TEXT('CIF REG 14')
044400000726     A                                      COLHDG( +
044500000726     A                                      'CIF' +
044600000726     A                                      'REG 14' +
044700000726     A                                      )
044800000726     A            FRCC15     00003A  B
044900000726     A                                      CCSID(00297)
045000000726     A                                      TEXT('CIF CDE 15')
045100000726     A                                      COLHDG( +
045200000726     A                                      'CIF' +
045300000726     A                                      'CDE 15' +
045400000726     A                                      )
045500000726     A            FRCR15     00003A  B
045600000726     A                                      CCSID(00297)
045700000726     A                                      TEXT('CIF REG 15')
045800000726     A                                      COLHDG( +
045900000726     A                                      'CIF' +
046000000726     A                                      'REG 15' +
046100000726     A                                      )
046200000726     A          K FRCNUF
